/* Natalie
	Henesys VIP Hair/Hair Color Change.
*/
var status = -1;
var beauty = 0;
var hair_Colo_new;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 0) {
        cm.dispose();
        return;
    } else {
        status++;
    }
    if (status == 0) {
        cm.sendSimple("我是美发店老板娜塔丽。只要你有皇家理发劵#v5150040#，就把头发交给我吧。选择你想做的事情吧。\r\n#b#L0#更换发型(使用皇家理发劵#v5150040#)#l\r\n#L1#染色(使用高级会员卡#v5151001#)#l");
    } else if (status == 1) {
        if (selection == 0) {
            var hair = cm.getPlayerStat("HAIR");
            hair_Colo_new = [];
            beauty = 1;
            if (cm.getPlayerStat("GENDER") == 0) {
                hair_Colo_new = [33170,33180,33190,33240,33250,36440,36450,36490,36510,36520,36580,36590,36600,36620,36630,36640,36650,36670,36680,36690,36700,36710,36720,36730,36750,36810,36820,36830,36840,36850,36860,36880,36890,36910,36920,36930,36940,36950,36990,33260,33270,33280,33290,33300,33310,33320,33330,33340,33360,33370,33380,33390,33400,33410,33430,33440,33460,33470,33480,33500,33520,33540,33550,33580,33600,33630,33640,33660,33810,33930,33940,33950,33960,35180,35200,35210,35220,35230,35240,35250,35260,35270,35280,35290,35300,35330,35340,35350,35360,35420,35430,35440,35450,35460,35470,35490,35510,35520,35560,35600,35620,35630,35650,35660,35680,35690,35700,35720,35730,35750,35760,35770,35790,35800,35950,35960,36070,36080,36130,36140,36180,36280,36310,36330,36340,36350,36360,36380,36390,36410];
            } else {
                hair_Colo_new = [37510,41660,37520,37530,37540,37560,37580,37590,37610,37620,37630,37640,37650,37670,37680,37690,37700,37710,37720,37730,37740,37750,37760,37770,37780,37790,37800,37810,37820,37830,37840,37850,37860,37880,37900,37910,37920,37930,37940,37950,37960,37970,37980,37990,38000,38010,38020,38030,38040,38050,38060,38070,38080,38090,38100,38110,38120,38130,38150,38160,38220,38240,38250,38260,38270,38280,38290,38300,38310,38320,38330,38340,38350,38360,38370,38380,38390,38400,38410,38420,38430,38440,38450,38460,38470,38480,38490,38500,38520,38530,38540,38560,38570,38580,38590,38600,38610,38620,38630,38640,38650,38660,38670,38680,38690,38700,38710,38730,38740,38750,38760,38770,38790,38800,38810,38840,38850,38860,38880,38890,38900,38910,38930,38940,34870,38150,34450];
            }
            for (var i = 0; i < hair_Colo_new.length; i++) {
                hair_Colo_new[i] = hair_Colo_new[i] + (hair % 10);
            }
            cm.askAvatar("我可以帮你换成全新的发型。你厌倦了现在的发型了吗？只要你有皇家理发劵#v5150040#，我就可以帮你更换发型。请慢慢挑选自己喜欢的发型～", 5150040, hair_Colo_new);
        } else if (selection == 1) {
            var currenthaircolo = Math.floor((cm.getPlayerStat("HAIR") / 10)) * 10;
            hair_Colo_new = [];
            beauty = 2;
            for (var i = 0; i < 8; i++) {
                hair_Colo_new[i] = currenthaircolo + i;
            }
            cm.askAvatar("我们可以为你改变头发的颜色。是不是已经厌倦了头发的颜色啊？如果你有皇家理发劵#v5151001#，我就可以给你染发，慢慢挑选你喜欢的颜色吧！", 5151001, hair_Colo_new);
        }
    } else if (status == 2) {
        if (beauty == 1) {
            if (cm.setAvatar(5150040 , hair_Colo_new[selection]) == 1) {
                cm.sendOk("理发好了，怎么样？看看你的新发型吧！");
            } else {
                cm.sendOk("嗯……你好像没有美发店专用会员卡啊？不好意思，没有会员卡#v5150040#的话，我就不能帮你理发。");
            }
        } else {
            if (cm.setAvatar(5151001, hair_Colo_new[selection]) == 1) {
                cm.sendOk("好了，让朋友们赞叹你的新发色吧！");
            } else {
                cm.sendOk("嗯… 看来你没有我们美发店的会嘛！不好意思，如果没有会员卡#v5151001#，我们不可以给你染头发。");
            }
        }
        cm.dispose();
    }
}