status = -1;
var itemList = Array(     
Array(4021010, 100, 1, 1), //时间之石
Array(2070005, 100, 1, 1), //时间之石
Array(2070006, 100, 1, 1), //时间之石
Array(1003863, 100, 1, 1), //时间之石
Array(1132228, 100, 1, 1), //时间之石
Array(1052612, 100, 1, 1), //时间之石
Array(1102562, 100, 1, 1), //时间之石
Array(1302277, 100, 1, 1), //1
Array(1332227, 100, 1, 1), //3
Array(1372179, 100, 1, 1), //4
Array(1382211, 100, 1, 1), //5
Array(1402199, 100, 1, 1), //6
Array(1432169, 100, 1, 1), //8
Array(1452207, 100, 1, 1), //10
Array(1462195, 100, 1, 1), //11
Array(1472216, 100, 1, 1), //12
Array(1402014, 50, 1, 1), //温度计,概率，数量，发不发喇叭
Array(1402037, 100, 1, 1), //龙背
Array(1302063, 300, 1, 1), //火焰刀
Array(1302106, 300, 1, 1), //燃烧的冰焰刀
Array(1402063, 500, 1, 1), //红伞
Array(1472054, 500, 1, 1), //信玄
Array(1302084, 600, 1, 1), //火柴
Array(1302085, 600, 1, 1), //叉子
Array(1302087, 600, 1, 1), //火炬
Array(1302104, 600, 1, 1), //鱿鱼剑
Array(1442039, 300, 1, 1), //冻冻雨
Array(1432013, 600, 1, 1), //南瓜枪
Array(1402044, 600, 1, 1), //南瓜灯笼
Array(1002699, 600, 1, 1), //南瓜帽子
Array(1402013, 600, 1, 1), //白日剑
Array(1332053, 600, 1, 1), //烧烤串
Array(1322071, 600, 1, 1), //采矿铁锹
Array(1332021, 600, 1, 1), //乌龙茶
Array(1302058, 600, 1, 1), //冒险岛伞
Array(1302080, 600, 1, 1), //七彩霓虹灯泡
Array(1302049, 600, 1, 1), //光线鞭子
Array(1302022, 600, 1, 1), //竹刀
Array(1332020, 600, 1, 1), //太极扇
Array(1050100, 600, 1, 1), //蓝浴巾
Array(1051098, 600, 1, 1), //红浴巾
Array(1050127, 600, 1, 1), //浴巾

Array(1302016, 600, 1, 1), //黄色雨伞
Array(1302027, 600, 1, 1), //绿雨伞
Array(1302026, 600, 1, 1), //黑雨伞
Array(1302029, 600, 1, 1), //褐雨伞
Array(1302028, 600, 1, 1), //紫雨伞
Array(1302025, 600, 1, 1), //红雨伞
Array(1302013, 600, 1, 1), //红色鞭子
Array(1302049, 600, 1, 1), //光线鞭子
Array(1302061, 600, 1, 1), //蔓藤鞭子
Array(1372017, 600, 1, 1), //领路灯
Array(1322008, 600, 1, 1), //007提包
Array(1322009, 600, 1, 1), //马桶吸
Array(1322003, 600, 1, 1), //棒棒果
Array(1322010, 600, 1, 1), //方形铁铲
Array(1322011, 600, 1, 1), //三角铁铲
Array(1322012, 600, 1, 1), //红色砖头
Array(1312012, 600, 1, 1), //乾坤圈
Array(1312013, 600, 1, 1), //判官笔
Array(1312014, 600, 1, 1), //阎王笔
Array(1432046, 600, 1, 1), //圣诞树手杖
Array(1332032, 600, 1, 1), //圣诞树

Array(1402029, 600, 1, 1), //鬼刺狼牙棒
Array(1382037, 200, 1, 1), //偃月之杖
Array(1382041, 500, 1, 1), //夜行權杖
Array(1332030, 600, 1, 1), //团扇
Array(1432017, 600, 1, 1), //滑雪板
Array(1432018, 600, 1, 1), //滑雪板
Array(1432015, 600, 1, 1), //滑雪板
Array(1432016, 600, 1, 1), //滑雪板
Array(1442046, 600, 1, 1), //滑雪板
Array(1072239, 600, 1, 1), //黄色钉鞋
Array(1072238, 600, 1, 1), //紫色钉鞋
Array(1102084, 500, 1, 1), //紫色盖亚
Array(1102086, 500, 1, 1), //粉色盖亚
Array(1382015, 500, 1, 1), //毒蘑菇
Array(1462020, 300, 1, 1), //烈焰之弩
Array(1382013, 300, 1, 1), //烈焰之杖
Array(1332028, 300, 1, 1), //烈焰之刃
Array(1302032, 300, 1, 1), //烈焰之剑
Array(1092050, 300, 1, 1), //冷艳剑盾
Array(1092049, 200, 1, 1), //热情剑盾
Array(1002939, 300, 1, 1), //安全帽	
Array(1002894, 500, 1, 1), //粉色编织发带
Array(1002895, 500, 1, 1), //红色编织发带
Array(1002896, 500, 1, 1), //紫色编织发带
Array(1002897, 500, 1, 1), //橙色编织发带
Array(1002898, 500, 1, 1), //绿色编织发带
Array(1002899, 500, 1, 1), //黄色编织发带
Array(1002900, 500, 1, 1), //蓝色编织发带
Array(1132013, 300, 1, 1), //不灭的法老腰带
Array(1012056, 500, 1, 1), //狗狗鼻
Array(1012058, 500, 1, 1), //匹诺曹的鼻子
Array(1012059, 500, 1, 1), //匹诺曹的鼻子
Array(1012060, 500, 1, 1), //匹诺曹的鼻子
Array(1012061, 500, 1, 1), //匹诺曹的鼻子
Array(1432037, 200, 1, 1), //枫叶大将棋
Array(1082145, 500, 1, 1), //工地手套
Array(1082146, 500, 1, 1), //工地手套
Array(1082147, 500, 1, 1), //工地手套
Array(1082148, 500, 1, 1), //工地手套
Array(1082149, 400, 1, 1), //褐色工地

Array(1122029, 100, 1, 1), //苏醒的冒险之心
Array(1122030, 100, 1, 1), //苏醒的冒险之心
Array(1122031, 100, 1, 1), //苏醒的冒险之心
Array(1122032, 100, 1, 1), //苏醒的冒险之心

Array(1302021, 500, 1, 1), //橡皮榔头
Array(1302024, 500, 1, 1), //废报纸卷
Array(1002418, 500, 1, 1), //废报纸头盔
Array(1302019, 600, 1, 1), //无名剑
Array(1312013, 600, 1, 1), //判官笔
Array(1382016, 600, 1, 1), //阎王笔
Array(1312014, 600, 1, 1), //阎王笔
Array(1322021, 600, 1, 1), //黑游泳圈
Array(1322023, 600, 1, 1), //蓝花纹游泳圈
Array(1322022, 600, 1, 1), //红花纹游泳圈
Array(1322024, 600, 1, 1), //紫游泳圈
Array(1322025, 600, 1, 1), //救命游泳圈
Array(1322026, 600, 1, 1), //彩虹游泳圈
Array(1322012, 600, 1, 1), //红色砖头
Array(1322031, 600, 1, 1), //葵花宝典
Array(1322027, 600, 1, 1), //平底锅

Array(3010314, 400, 1, 1), //红丝带月妙靠垫
Array(3010315, 400, 1, 1), //红丝带月妙靠垫
Array(3010316, 400, 1, 1), //红丝带月妙靠垫
Array(3010317, 400, 1, 1), //红丝带月妙靠垫
Array(3010894, 400, 1, 1), //咖啡
Array(3010854, 400, 1, 1), //欢聚一趟
Array(3010842, 400, 1, 1), //房车
Array(3010843, 400, 1, 1), //房车
Array(3010760, 400, 1, 1), //古代浴池
Array(3010800, 400, 1, 1), //拜年
Array(3010801, 400, 1, 1), //拜年
Array(3010802, 400, 1, 1), //拜年
Array(3010803, 400, 1, 1), //拜年
Array(3010804, 400, 1, 1), //拜年
Array(3010194, 400, 1, 1), //篝火
Array(3010767, 400, 1, 1), //雪人
Array(3010754, 400, 1, 1), //百鬼
Array(3010752, 400, 1, 1), //玫瑰鸟笼
Array(3010744, 400, 1, 1), //砖头
Array(3010735, 400, 1, 1), //浪漫长椅
Array(3010734, 400, 1, 1), //猫想
Array(3010794, 400, 1, 1), //舌头
Array(3010795, 400, 1, 1), //栖息
Array(3010714, 400, 1, 1), //王冠
Array(3010730, 400, 1, 1), //合唱
Array(3010411, 400, 1, 1), //双鱼
Array(3010412, 400, 1, 1), //双塔
Array(3010717, 400, 1, 1), //戒子
Array(3010600, 400, 1, 1), //福星
Array(3010596, 400, 1, 1), //风筝
Array(3010029, 400, 1, 1), //蓝环凳
Array(3010030, 400, 1, 1), //黑环凳
Array(3010031, 400, 1, 1), //红环凳
Array(3010032, 400, 1, 1), //黄环凳
Array(3010033, 400, 1, 1), //绿环凳
Array(3010661, 400, 1, 1), //相框
Array(3010631, 400, 1, 1), //金龙鱼
Array(3010608, 400, 1, 1), //完美
Array(3010609, 400, 1, 1), //做梦
Array(3010620, 400, 1, 1), //泄愤
Array(3010133, 400, 1, 1), //帐篷
Array(3010152, 400, 1, 1), //三角
Array(3010044, 400, 1, 1), //红伞
Array(3010021, 400, 1, 1), //暖暖
Array(3012022, 400, 1, 1), //寿司
Array(3010151, 400, 1, 1), //无人
Array(3010191, 400, 1, 1), //爱情
Array(3010206, 400, 1, 1), //画家
Array(3010086, 400, 1, 1), //沙发
Array(3012002, 400, 1, 1), //浴桶
Array(3012006, 400, 1, 1), //稻香
Array(3012011, 400, 1, 1), //火锅
Array(3010320, 400, 1, 1), //奶奶
Array(3010898, 400, 1, 1), //迷你神兽椅子
Array(3010895, 400, 1, 1), //阿卡伊勒童话
Array(3010492, 400, 1, 1), //首脑椅子
Array(3010494, 400, 1, 1), //TV椅子
Array(3010879, 400, 1, 1), //繁星椅子
Array(3010465, 400, 1, 1), //可爱音符椅子
Array(3010456, 400, 1, 1), //杜鹃花椅子
Array(3012008, 400, 1, 1), //稻荷神社
Array(3010449, 400, 1, 1), //痊愈10周椅子
Array(3010440, 400, 1, 1), //寻找故乡的月妙椅子

Array(3010448, 400, 1, 1), //泡泡浴椅子
Array(3010435, 400, 1, 1), //千年狐椅子
Array(3010099, 400, 1, 1), //鬼娃娃椅子
Array(3010085, 400, 1, 1), //大熊猫椅子

Array(3010110, 400, 1, 1), //舒适大白熊椅子
Array(3010100, 400, 1, 1), //财神椅子
Array(3010814, 400, 1, 1), //粉丝抱枕椅子
Array(3010375, 400, 1, 1), //奥妙的超级药水椅子
Array(3010377, 400, 1, 1), //新鲜的蓝色药水椅子
Array(3010376, 400, 1, 1), //橙色HP药水椅子
Array(3010300, 400, 1, 1), //超级药水椅子
Array(3010302, 400, 1, 1), //闪耀星星之夜椅子
Array(3010374, 400, 1, 1), //云朵洗手间椅子

Array(3010737, 400, 1, 1), //动物英雄团椅子
Array(3010738, 400, 1, 1), //闪电三人组椅子
Array(3010739, 400, 1, 1), //雪人香波椅子
Array(3010065, 400, 1, 1), //粉红海滩遮阳椅
Array(3010806, 400, 1, 1), //桃樱芳菲椅
Array(3010664, 400, 1, 1), //进化椅子
Array(3010659, 400, 1, 1), //巴士车站椅子

Array(3010511, 400, 1, 1), //猫咪公园椅子
Array(3014000, 400, 1, 1), //惊人漫画椅子
Array(3010946, 400, 1, 1), //森林伙伴野营椅子
Array(3010402, 400, 1, 1), //生日派对椅
Array(3010966, 400, 1, 1), //幽灵船椅子
Array(3012024, 300, 1, 1), //沙滩排球椅子
Array(3012019, 300, 1, 1), //爱琴海椅子
Array(3010690, 300, 1, 1), //滑浪飞船椅子
Array(3010660, 300, 1, 1), //梦幻公主城堡椅子
Array(3010073, 300, 1, 1), //梦
Array(3010070, 50, 1, 1), //巨无霸国际巨星

Array(3015304, 20, 1, 1), //大水车
Array(1902063, 300, 1, 1), //御剑飞行
Array(1912056, 300, 1, 1), //御剑飞行 

Array(1372035, 300, 1, 1), //雷灵珠短杖
Array(1372036, 300, 1, 1), //火灵珠短杖
Array(1372037, 300, 1, 1), //冰灵珠短杖
Array(1372038, 300, 1, 1), //毒灵珠短杖
Array(1382045, 300, 1, 1), //毒灵珠短杖
Array(1382046, 300, 1, 1), //毒灵珠短杖
Array(1382047, 300, 1, 1), //毒灵珠短杖
Array(1382048, 300, 1, 1), //毒灵珠短杖
Array(1382037, 300, 1, 1), //偃月之杖
Array(2340000, 600, 1, 1), //41111
Array(2340000, 600, 1, 1), //41111
Array(2340000, 600, 1, 1), //41111
Array(2340000, 600, 1, 1), //祝福卷轴
Array(2049100, 600, 1, 1), //祝福卷轴
Array(2049100, 600, 1, 1), //祝福卷轴
Array(2049100, 600, 1, 1), //祝福卷轴
Array(2049100, 600, 1, 1), //祝福卷轴
Array(2040001, 600, 1, 0), //头盔防御卷轴60%
Array(2040002, 600, 1, 0), //头盔防御卷轴10%
Array(2040004, 600, 1, 0), //头盔体力卷轴60%
Array(2040005, 600, 1, 0), //头盔体力卷轴10%
Array(2040016, 600, 1, 0), //头盔命中率卷轴10%
Array(2040017, 600, 1, 0), //头盔命中率卷轴60%
Array(2040025, 600, 1, 0), //头盔智力卷轴60%
Array(2040026, 600, 1, 1), //头盔智力卷轴10%
Array(2040029, 600, 1, 0), //头盔敏捷卷轴60%
Array(2040031, 600, 1, 1), //头盔敏捷卷轴10%
Array(2040100, 600, 1, 0), //脸部装饰生命卷轴10%
Array(2040101, 600, 1, 0), //脸部装饰生命卷轴60%
Array(2040105, 600, 1, 1), //脸部装饰回避率卷轴10%
Array(2040106, 600, 1, 0), //脸部装饰回避率卷轴60%
Array(2040200, 600, 1, 1), //眼部装饰命中率卷轴10%
Array(2040201, 600, 1, 1), //眼部装饰命中率卷轴60%
Array(2040205, 600, 1, 1), //眼部装饰智力卷轴10%
Array(2040206, 600, 1, 1), //眼部装饰智力卷轴60%
Array(2040301, 600, 1, 0), //耳环智力卷轴60%
Array(2040302, 650, 1, 1), //耳环智力卷轴10%
Array(2040310, 600, 1, 0), //耳环防御力卷轴10%
Array(2040311, 600, 1, 0), //耳环防御力卷轴60%
Array(2040317, 600, 1, 0), //耳环敏捷卷轴60%
Array(2040318, 600, 1, 1), //耳环敏捷卷轴10%
Array(2040321, 600, 1, 0), //耳环装饰运气卷轴60%
Array(2040323, 600, 1, 1), //耳环运气卷轴10%
Array(2040326, 600, 1, 0), //耳环装饰体力卷轴60%
Array(2040328, 600, 1, 0), //耳环装饰体力卷轴10%
Array(2040412, 600, 1, 0), //上衣运气卷轴10%
Array(2040413, 600, 1, 0), //上衣运气卷轴60%
Array(2040418, 600, 1, 0), //上衣力量卷轴60%
Array(2040419, 600, 1, 0), //上衣力量卷轴10%
Array(2040421, 600, 1, 0), //上衣体力卷轴60%
Array(2040422, 600, 1, 0), //上衣体力卷轴10%
Array(2040425, 600, 1, 0), //上衣运气卷轴60%
Array(2040427, 600, 1, 0), //上衣运气卷轴10%
Array(2040501, 600, 1, 0), //全身铠甲敏捷卷轴60%
Array(2040502, 600, 1, 1), //全身铠甲敏捷卷轴10%
Array(2040504, 600, 1, 0), //全身铠甲防御卷轴60%
Array(2040505, 600, 1, 0), //全身铠甲防御卷轴10%
Array(2040513, 600, 1, 0), //全身铠甲智力卷轴60%
Array(2040514, 600, 1, 0), //全身铠甲智力卷轴10%
Array(2040516, 600, 1, 0), //全身铠甲运气卷轴60%
Array(2040517, 600, 1, 0), //全身铠甲运气卷轴10%
Array(2040532, 600, 1, 0), //全身盔甲力量卷轴60%
Array(2040534, 600, 1, 1), //全身盔甲力量卷轴10%
Array(2040601, 600, 1, 0), //裤/裙防御卷轴60%
Array(2040602, 600, 1, 0), //裤/裙防御卷轴10%
Array(2040612, 600, 1, 0), //裤裙敏捷卷轴10%
Array(2040613, 600, 1, 0), //裤裙敏捷卷轴60%
Array(2040618, 600, 1, 0), //裤裙跳跃卷轴60%
Array(2040619, 600, 1, 0), //裤裙跳跃卷轴10%
Array(2040621, 600, 1, 0), //裤裙体力卷轴60%
Array(2040622, 600, 1, 0), //裤裙体力卷轴10%
Array(2040625, 600, 1, 0), //裤裙敏捷卷轴60%
Array(2040627, 600, 1, 0), //裤裙敏捷卷轴10%
Array(2040701, 600, 1, 0), //鞋子敏捷度卷轴60%
Array(2040702, 600, 1, 0), //鞋子敏捷度卷轴10%
Array(2040704, 600, 1, 0), //鞋子跳跃卷轴60%
Array(2040705, 600, 1, 0), //鞋子跳跃卷轴10%
Array(2040707, 600, 1, 0), //鞋子速度卷轴60%
Array(2040708, 600, 1, 0), //鞋子速度卷轴10%
Array(2040801, 600, 1, 1), //手套敏捷卷轴60%
Array(2040802, 600, 1, 1), //手套敏捷卷轴10%
Array(2040804, 600, 1, 1), //手套攻击卷轴60%
Array(2040805, 600, 1, 1), //手套攻击卷轴10%
Array(2040816, 600, 1, 0), //手套魔力卷轴10%
Array(2040817, 600, 1, 0), //手套魔力卷轴60%
Array(2040824, 600, 1, 0), //手套体力卷轴60%
Array(2040825, 600, 1, 0), //手套体力卷轴10%
Array(2040901, 600, 1, 0), //盾牌防御卷轴60%
Array(2040902, 600, 1, 0), //盾牌防御卷轴10%
Array(2040914, 600, 1, 0), //盾牌攻击卷轴60%
Array(2040915, 600, 1, 0), //盾牌攻击卷轴10%
Array(2040919, 600, 1, 0), //盾牌魔力卷轴60%
Array(2040920, 600, 1, 0), //盾牌魔力卷轴10%
Array(2040924, 600, 1, 0), //盾牌运气卷轴60%
Array(2040925, 600, 1, 0), //盾牌运气卷轴10%
Array(2040927, 600, 1, 0), //盾牌体力卷轴60%
Array(2040928, 600, 1, 0), //盾牌体力卷轴10%
Array(2040931, 600, 1, 0), //盾牌力量卷轴60%
Array(2040933, 600, 1, 0), //盾牌力量卷轴10%
Array(2041001, 600, 1, 0), //披风魔防卷轴60%
Array(2041002, 600, 1, 0), //披风魔防卷轴10%
Array(2041004, 600, 1, 0), //披风防御卷轴60%
Array(2041005, 600, 1, 0), //披风防御卷轴10%
Array(2041007, 600, 1, 0), //披风体力卷轴60%
Array(2041008, 600, 1, 0), //披风体力卷轴10%
Array(2041010, 600, 1, 0), //披风魔力卷轴60%
Array(2041011, 600, 1, 0), //披风魔力卷轴10%
Array(2041013, 600, 1, 0), //披风力量卷轴60%
Array(2041014, 600, 1, 0), //披风力量卷轴10%
Array(2041016, 600, 1, 0), //披风智力卷轴60%
Array(2041017, 600, 1, 0), //披风智力卷轴10%
Array(2041019, 600, 1, 0), //披风敏捷卷轴60%
Array(2041020, 600, 1, 0), //披风敏捷卷轴10%
Array(2041022, 600, 1, 0), //披风运气卷轴60%
Array(2041023, 600, 1, 0), //披风运气卷轴10%
Array(2041201, 600, 1, 1), //项链运气卷轴10%
Array(2041202, 600, 1, 1), //项链运气卷轴60%
Array(2041206, 600, 1, 1), //项链力量卷轴10%
Array(2041207, 600, 1, 1), //项链力量卷轴60%
Array(2041301, 600, 1, 0), //腰带力量卷轴60%
Array(2041304, 600, 1, 0), //腰带智力卷轴60%
Array(2041307, 600, 1, 0), //腰带敏捷卷轴60%
Array(2041310, 600, 1, 0), //腰带运气卷轴60%
Array(2043001, 600, 1, 0), //单手剑攻击卷轴60%
Array(2043002, 600, 1, 0), //单手剑攻击卷轴10%
Array(2043008, 600, 1, 0), //单手剑魔力卷轴10%
Array(2043009, 600, 1, 0), //单手剑魔力卷轴60%
Array(2043017, 600, 1, 0), //单手剑命中率卷轴60%
Array(2043019, 600, 1, 0), //单手剑命中率卷轴10%
Array(2043301, 600, 1, 0), //短剑攻击卷轴60%
Array(2043302, 600, 1, 0), //短剑攻击卷轴10%
Array(2043701, 600, 1, 0), //短杖魔力卷轴60%
Array(2043702, 600, 1, 0), //短杖魔力卷轴10%
Array(2043801, 600, 1, 0), //长杖魔力卷轴60%
Array(2043802, 600, 1, 0), //长杖魔力卷轴10%
Array(2044001, 600, 1, 1), //双手剑攻击卷轴60%
Array(2044002, 600, 1, 1), //双手剑攻击卷轴10%
Array(2044012, 600, 1, 0), //双手剑命中率卷轴60%
Array(2044014, 600, 1, 0), //双手剑命中率卷轴10%
Array(2044301, 600, 1, 1), //枪攻击卷轴60%
Array(2044302, 600, 1, 1), //枪攻击卷轴10%
Array(2044312, 600, 1, 0), //枪命中率卷轴60%
Array(2044314, 600, 1, 0), //枪命中率卷轴10%
Array(2044501, 600, 1, 0), //弓攻击卷轴60%
Array(2044502, 600, 1, 0), //弓攻击卷轴10%
Array(2044001, 600, 1, 0), //2攻击卷轴60%
Array(2044002, 600, 1, 0), //2攻击卷轴10%
Array(2044701, 600, 1, 0), //3攻击卷轴60%
Array(2044702, 600, 1, 0), //3攻击卷轴10%
Array(2044601, 600, 1, 0), //弩攻击卷轴60%
Array(2044602, 600, 1, 0) //弩攻击卷轴10%
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("#v4032226#你有吗？？");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4032226, 1)) {
			var itemt = "";
			for (var i = 0; i < itemList.length; i++) {
			itemt += "#v"+itemList[i][0]+"#";
			}
			itemt += "\r\n\r\n#v4032226#你想要抽奖吗?在线奖励，和活动都能得到金猪哦~！";
            cm.sendYesNo(itemt);
           // cm.sendYesNo("#v4032226#你想要抽奖吗？？?");
        } else {
            cm.sendOk("你想要抽奖吗？如果要抽奖，你的身上必须要拥有#v4032226#哦！");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 600);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "金猪抽奖", notice);
            if (item != -1) {
                cm.gainItem(4032226, -1);
                cm.sendOk("恭喜你获得#b#t" + item + "##k " + quantity + "一个");
            } else {
                cm.sendOk("你想要抽奖吗?如果要抽奖，你的身上必须要拥有#v4032226#哦！");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("什么都没抽到 ,返还一个 #v4032226# 给你!.");
            cm.gainItem(4032226, -1);
            cm.gainItem(4032226, 1);
            cm.safeDispose();
        }
    }
}