status = -1;
var itemList = Array(
//-------耳环-------
Array(2290000,800,1,1),
			Array(2290096,300,1,1),//冒险岛勇士20
			Array(2290125,100,1,1),//冒险岛勇士30
			Array(2280004,800,1,1),//终极无限
			Array(2290028,800,1,1),//终极无限20
			Array(2290029,800,1,1),//终极无限30
			Array(2290000,800,1,1),//磁石20
			Array(2290001,800,1,1),//磁石
			Array(2290002,800,1,1),//阿基里斯20
			Array(2290003,800,1,1),//阿基里斯30
			Array(2280012,800,1,1),//突进
			Array(2290004,800,1,1),//突进20
			Array(2290005,800,1,1),//突进30
			Array(2290006,800,1,1),//稳如泰山20
			Array(2290007,800,1,1),//稳如泰山30
			Array(2290010,800,1,1),//轻舞飞扬20
			Array(2290011,800,1,1),//轻舞飞扬30
			Array(2290012,800,1,1),//连环环破20
			Array(2290013,800,1,1),//连环环破30
			Array(2290014,800,1,1),//寒冰掌20
			Array(2290015,800,1,1),//寒冰掌30
			Array(2290016,800,1,1),//葵花20
			Array(2290017,800,1,1),//葵花30
			Array(2290018,800,1,1),//圣印之剑
			Array(2290019,800,1,1),//圣印之锤
			Array(2290020,800,1,1),//圣域20
			Array(2290021,800,1,1),//圣域30
			Array(2290022,800,1,1),//恶龙20
			Array(2290023,800,1,1),//恶龙30
			Array(2290024,800,1,1),//魔法反击20
			Array(2290025,800,1,1),//魔法反击30
			Array(2290026,800,1,1),//创世20
			Array(2290027,800,1,1),//创世30
			Array(2290030,800,1,1),//连环爆破20
			Array(2290031,800,1,1),//连环爆破30
			Array(2290032,800,1,1),//闪电20
			Array(2290033,800,1,1),//闪电30
			Array(2290034,800,1,1),//圣灵20
			Array(2290035,800,1,1),//圣灵30
			Array(2290036,800,1,1),//火凤20
			Array(2290037,800,1,1),//火凤30
			Array(2290038,800,1,1),//冰兽20
			Array(2290039,800,1,1),//冰兽30
			Array(2290040,800,1,1),//天降20
			Array(2290041,800,1,1),//天降30
			Array(2290042,800,1,1),//冰球20
			Array(2290043,800,1,1),//冰球30
			Array(2290044,800,1,1),//火魔20
			Array(2290045,800,1,1),//火魔30
			Array(2290046,800,1,1),//冰霜20
			Array(2290047,800,1,1),//冰霜30
			Array(2290048,800,1,1),//圣光20
			Array(2290049,800,1,1),//圣光30
			Array(2290052,800,1,1),//火眼20
			Array(2290053,800,1,1),//火眼30
			Array(2290056,800,1,1),//神箭手20
			Array(2290057,800,1,1),//神箭手30
			Array(2290058,800,1,1),//击退箭20
			Array(2290059,800,1,1),//击退箭30
			Array(2290060,800,1,1),//暴风剑雨20
			Array(2290061,800,1,1),//暴风剑雨30
			Array(2290062,800,1,1),//火凤20
			Array(2290063,800,1,1),//火凤30
			Array(2290064,800,1,1),//集中20
			Array(2290065,800,1,1),//集中30
			Array(2290066,800,1,1),//神弩20
			Array(2290067,800,1,1),//神弩30
			Array(2290068,800,1,1),//刺眼20
			Array(2290069,800,1,1),//刺眼30
			Array(2290070,800,1,1),//穿透20
			Array(2290071,800,1,1),//穿透30
			Array(2290072,800,1,1),//破鹰20
			Array(2290073,800,1,1),//破鹰30
			Array(2290074,800,1,1),//一击20
			Array(2290075,800,1,1),//一击30
			Array(2290076,800,1,1),//假动作20
			Array(2290077,800,1,1),//假动作30
			Array(2290078,800,1,1),//毒液20
			Array(2290079,800,1,1),//毒液30
			Array(2290080,800,1,1),//挑衅20
			Array(2290081,800,1,1),//挑衅30
			Array(2290082,800,1,1),//伏击20
			Array(2290083,800,1,1),//伏击30
			Array(2290084,800,1,1),//三飞20
			Array(2290085,800,1,1),//三飞30
			Array(2290086,800,1,1),//冲击20
			Array(2290087,800,1,1),//冲级30
			Array(2290088,800,1,1),//暗器20
			Array(2290089,800,1,1),//暗器30
			Array(2290090,800,1,1),//双击20
			Array(2290091,800,1,1),//双击30
			Array(2290092,800,1,1),//暗杀20
			Array(2290093,800,1,1),//暗杀30
			Array(2290094,800,1,1),//烟雾20
			Array(2290095,800,1,1),//烟雾30
			Array(2290089,800,1,1),//暗器30
			Array(2290089,800,1,1),//暗器30
			Array(2290089,800,1,1),//暗器30
			Array(2290089,800,1,1),//暗器30
			Array(2290089,800,1,1),//暗器30
			Array(2290089,800,1,1),//暗器30
			Array(2290089,800,1,1),//暗器30
			Array(2290089,800,1,1),//暗器30
			Array(2290089,800,1,1),//暗器30
			Array(2290089,800,1,1),//暗器30
			Array(2290089,800,1,1),//暗器30
			Array(2280004,800,1,1),//终极无限
			Array(2280004,800,1,1),//终极无限
			Array(2280005,800,1,1),//飞龙冲击波
			Array(2290054,800,1,1),//飞龙冲击波20
			Array(2290055,800,1,1),//飞龙冲击波30
			Array(2280006,800,1,1),//挑衅
			Array(2280007,800,1,1),//进阶斗气
			Array(2290008,800,1,1),//进阶斗气20
			Array(2290009,800,1,1),//进阶斗气30
			Array(2280008,800,1,1),//万佛归一
			Array(2280009,800,1,1),//光芒飞剑
			Array(2290050,800,1,1),//光芒飞剑20
			Array(2290051,800,1,1),//光芒飞剑30
			Array(2280010,800,1,1),//三连环光鸡婆
			Array(2280000,800,1,1),//火凤球
			Array(2280001,800,1,1),//烟雾弹
			Array(2280002,800,1,1),//坚定的意志
			Array(2280011,800,1,1),//冰凤球
			Array(2280012,800,1,1)//突进
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("所有技能书都在这里！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4000313,15)) {
            cm.sendYesNo("你好，这里是黄金枫叶宝库，在这里可以用战利品抽取技能册，你要抽取吗？");
        } else {
            cm.sendOk("你背包里有#b#t4000313##k吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 800);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "黄金枫叶宝库", notice);
            if (item != -1) {
                cm.gainItem(4000313, -15);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#t4000313##k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：白雪人法老的蓝宝石。)");
            cm.gainItem(4001084, -15);
            cm.gainItem(4001084, 15);
            cm.safeDispose();
        }
    }
}