status = -1;
var itemList = Array(     
Array(2340000, 500, 1, 0), //头盔防御卷轴60%
Array(2340000, 500, 1, 0), //头盔防御卷轴60%
Array(2340000, 500, 1, 0), //头盔防御卷轴60%
Array(2040001, 500, 1, 0), //头盔防御卷轴60%
Array(2040001, 500, 1, 0), //头盔防御卷轴60%
Array(2040002, 500, 1, 0), //头盔防御卷轴10%
Array(2040004, 500, 1, 0), //头盔体力卷轴60%
Array(2040005, 500, 1, 0), //头盔体力卷轴10%
Array(2040012, 500, 1, 1), //头盔智力卷轴70%
Array(2040013, 500, 1, 1), //头盔智力卷轴30%
Array(2040016, 500, 1, 0), //头盔命中率卷轴10%
Array(2040017, 500, 1, 0), //头盔命中率卷轴60%
Array(2040019, 500, 1, 0), //头盔防御卷轴65%
Array(2040020, 500, 1, 0), //头盔防御卷轴15%
Array(2040021, 500, 1, 0), //头盔体力卷轴65%
Array(2040022, 500, 1, 0), //头盔体力卷轴15%
Array(2040025, 500, 1, 0), //头盔智力卷轴60%
Array(2040026, 500, 1, 1), //头盔智力卷轴10%
Array(2040028, 500, 1, 0), //头盔敏捷卷轴70%
Array(2040029, 500, 1, 0), //头盔敏捷卷轴60%
Array(2040030, 500, 1, 0), //头盔敏捷卷轴30%
Array(2040031, 500, 1, 1), //头盔敏捷卷轴10%
Array(2040100, 500, 1, 1), //脸部装饰生命卷轴10%
Array(2040101, 500, 1, 1), //脸部装饰生命卷轴60%
Array(2040105, 500, 1, 1), //脸部装饰回避率卷轴10%
Array(2040106, 500, 1, 1), //脸部装饰回避率卷轴60%
Array(2040200, 500, 1, 1), //眼部装饰命中率卷轴10%
Array(2040201, 500, 1, 1), //眼部装饰命中率卷轴60%
Array(2040205, 500, 1, 1), //眼部装饰智力卷轴10%
Array(2040206, 500, 1, 1), //眼部装饰智力卷轴60%
Array(2040301, 500, 1, 1), //耳环智力卷轴60%
Array(2040302, 500, 1, 1), //耳环智力卷轴10%
Array(2040304, 500, 1, 1), //耳环智力诅咒卷轴70%
Array(2040305, 500, 1, 1), //耳环智力诅咒卷轴30%
Array(2040306, 500, 1, 1), //耳环敏捷卷轴70%
Array(2040307, 500, 1, 1), //耳环敏捷卷轴30%
Array(2040310, 500, 1, 1), //耳环防御力卷轴10%
Array(2040311, 500, 1, 1), //耳环防御力卷轴60%
Array(2040313, 500, 1, 1), //耳环智力卷轴65%
Array(2040314, 500, 1, 1), //耳环智力卷轴15%
Array(2040317, 500, 1, 1), //耳环敏捷卷轴60%
Array(2040318, 500, 1, 1), //耳环敏捷卷轴10%
Array(2040320, 500, 1, 1), //耳环运气卷轴70%
Array(2040321, 500, 1, 1), //耳环装饰运气卷轴60%
Array(2040322, 500, 1, 1), //耳环装饰运气卷轴30%
Array(2040323, 500, 1, 1), //耳环运气卷轴10%
Array(2040325, 500, 1, 1), //耳环装饰体力卷轴70%
Array(2040326, 500, 1, 1), //耳环装饰体力卷轴60%
Array(2040327, 500, 1, 1), //耳环装饰体力卷轴30%
Array(2040328, 500, 1, 1), //耳环装饰体力卷轴10%
Array(2040401, 500, 1, 0), //上衣防御卷轴60%
Array(2040402, 500, 1, 0), //上衣防御卷轴10%
Array(2040406, 500, 1, 0), //上衣力量卷轴70%
Array(2040407, 500, 1, 0), //上衣力量卷轴30%
Array(2040408, 500, 1, 0), //上衣体力卷轴70%
Array(2040409, 500, 1, 0), //上衣体力卷轴30%
Array(2040412, 500, 1, 0), //上衣运气卷轴10%
Array(2040413, 500, 1, 0), //上衣运气卷轴60%
Array(2040415, 500, 1, 0), //上衣防御力卷轴65%
Array(2040416, 500, 1, 0), //上衣防御力卷轴15%
Array(2040418, 500, 1, 0), //上衣力量卷轴60%
Array(2040419, 500, 1, 0), //上衣力量卷轴10%
Array(2040421, 500, 1, 0), //上衣体力卷轴60%
Array(2040422, 500, 1, 0), //上衣体力卷轴10%
Array(2040424, 500, 1, 0), //上衣运气卷轴70%
Array(2040425, 500, 1, 0), //上衣运气卷轴60%
Array(2040426, 500, 1, 0), //上衣运气卷轴30%
Array(2040427, 500, 1, 0), //上衣运气卷轴10%
Array(2040501, 500, 1, 1), //全身铠甲敏捷卷轴60%
Array(2040502, 500, 1, 1), //全身铠甲敏捷卷轴10%
Array(2040504, 500, 1, 1), //全身铠甲防御卷轴60%
Array(2040505, 500, 1, 1), //全身铠甲防御卷轴10%
Array(2040513, 500, 1, 1), //全身铠甲智力卷轴60%
Array(2040514, 500, 1, 1), //全身铠甲智力卷轴10%
Array(2040516, 500, 1, 1), //全身铠甲运气卷轴60%
Array(2040517, 500, 1, 1), //全身铠甲运气卷轴10%
Array(2040518, 500, 1, 1), //全身盔甲智力卷轴70%
Array(2040519, 500, 1, 1), //全身盔甲智力卷轴30%
Array(2040520, 500, 1, 1), //全身盔甲幸运卷轴70%
Array(2040521, 500, 1, 1), //全身盔甲幸运卷轴30%
Array(2040522, 500, 1, 1), //全身盔甲敏捷卷轴65%
Array(2040523, 500, 1, 1), //全身盔甲敏捷卷轴15%
Array(2040524, 500, 1, 1), //全身盔甲防御卷轴65%
Array(2040525, 500, 1, 1), //全身盔甲防御卷轴15%
Array(2040526, 500, 1, 1), //全身盔甲智力卷轴65%
Array(2040527, 500, 1, 1), //全身盔甲智力卷轴15%
Array(2040528, 500, 1, 1), //全身盔甲幸运卷轴65%
Array(2040529, 500, 1, 1), //全身盔甲幸运卷轴15%
Array(2040531, 500, 1, 1), //全身盔甲力量卷轴70%
Array(2040532, 500, 1, 1), //全身盔甲力量卷轴60%
Array(2040533, 500, 1, 1), //全身盔甲力量卷轴30%
Array(2040534, 500, 1, 1), //全身盔甲力量卷轴10%
Array(2040601, 500, 1, 0), //裤/裙防御卷轴60%
Array(2040602, 500, 1, 0), //裤/裙防御卷轴10%
Array(2040612, 500, 1, 0), //裤裙敏捷卷轴10%
Array(2040613, 500, 1, 0), //裤裙敏捷卷轴60%
Array(2040615, 500, 1, 0), //裤裙防御卷轴65%
Array(2040616, 500, 1, 0), //裤裙防御卷轴15%
Array(2040618, 500, 1, 0), //裤裙跳跃卷轴60%
Array(2040619, 500, 1, 0), //裤裙跳跃卷轴10%
Array(2040621, 500, 1, 0), //裤裙体力卷轴60%
Array(2040622, 500, 1, 0), //裤裙体力卷轴10%
Array(2040624, 500, 1, 0), //裤裙敏捷卷轴70%
Array(2040625, 500, 1, 0), //裤裙敏捷卷轴60%
Array(2040626, 500, 1, 0), //裤裙敏捷卷轴30%
Array(2040627, 500, 1, 0), //裤裙敏捷卷轴10%
Array(2040701, 500, 1, 0), //鞋子敏捷度卷轴60%
Array(2040702, 500, 1, 0), //鞋子敏捷度卷轴10%
Array(2040703, 500, 1, 0), //鞋子跳跃卷轴100%
Array(2040704, 500, 1, 0), //鞋子跳跃卷轴60%
Array(2040705, 500, 1, 0), //鞋子跳跃卷轴10%
Array(2040707, 500, 1, 0), //鞋子速度卷轴60%
Array(2040708, 500, 1, 0), //鞋子速度卷轴10%
Array(2040718, 500, 1, 0), //鞋子敏捷卷轴65%
Array(2040719, 500, 1, 0), //鞋子敏捷卷轴15%
Array(2040720, 500, 1, 0), //鞋子跳跃卷轴65%
Array(2040721, 500, 1, 0), //鞋子跳跃卷轴15%
Array(2040722, 500, 1, 0), //鞋子速度卷轴65%
Array(2040723, 500, 1, 0), //鞋子速度卷轴15%
Array(2040727, 500, 1, 0), //鞋子防滑卷轴10%
Array(2040801, 500, 1, 1), //手套敏捷卷轴60%
Array(2040802, 500, 1, 1), //手套敏捷卷轴10%
Array(2040804, 500, 1, 1), //手套攻击卷轴60%
Array(2040805, 500, 1, 1), //手套攻击卷轴10%
Array(2040812, 500, 1, 1), //手套体力卷轴70%
Array(2040813, 500, 1, 1), //手套体力卷轴30%
Array(2040816, 500, 1, 1), //手套魔力卷轴10%
Array(2040817, 500, 1, 1), //手套魔力卷轴60%
Array(2040819, 500, 1, 1), //手套敏捷卷轴65%
Array(2040820, 500, 1, 1), //手套敏捷卷轴15%
Array(2040821, 500, 1, 1), //手套攻击卷轴65%
Array(2040822, 500, 1, 1), //手套攻击卷轴15%
Array(2040824, 500, 1, 0), //手套体力卷轴60%
Array(2040825, 500, 1, 0), //手套体力卷轴10%
Array(2040900, 500, 1, 1), //盾牌防御卷轴
Array(2040901, 500, 1, 1), //盾牌防御卷轴60%
Array(2040902, 500, 1, 1), //盾牌防御卷轴10%
Array(2040906, 500, 1, 1), //盾牌运气卷轴70%
Array(2040907, 500, 1, 1), //盾牌运气卷轴30%
Array(2040908, 500, 1, 1), //盾牌体力卷轴70%
Array(2040909, 500, 1, 1), //盾牌体力卷轴30%
Array(2040910, 500, 1, 1), //盾牌防御卷轴65%
Array(2040911, 500, 1, 1), //盾牌防御卷轴15%
Array(2040914, 500, 1, 1), //盾牌攻击卷轴60%
Array(2040915, 500, 1, 1), //盾牌攻击卷轴10%
Array(2040919, 500, 1, 1), //盾牌魔力卷轴60%
Array(2040920, 500, 1, 1), //盾牌魔力卷轴10%
Array(2040924, 500, 1, 1), //盾牌运气卷轴60%
Array(2040925, 500, 1, 1), //盾牌运气卷轴10%
Array(2040927, 500, 1, 1), //盾牌体力卷轴60%
Array(2040928, 500, 1, 1), //盾牌体力卷轴10%
Array(2040930, 500, 1, 1), //盾牌力量卷轴70%
Array(2040931, 500, 1, 1), //盾牌力量卷轴60%
Array(2040932, 500, 1, 1), //盾牌力量卷轴30%
Array(2040933, 500, 1, 1), //盾牌力量卷轴10%
Array(2041001, 500, 1, 0), //披风魔防卷轴60%
Array(2041002, 500, 1, 0), //披风魔防卷轴10%
Array(2041004, 500, 1, 0), //披风防御卷轴60%
Array(2041005, 500, 1, 0), //披风防御卷轴10%
Array(2041007, 500, 1, 0), //披风体力卷轴60%
Array(2041008, 500, 1, 0), //披风体力卷轴10%
Array(2041010, 600, 1, 0), //披风魔力卷轴60%
Array(2041011, 600, 1, 0), //披风魔力卷轴10%
Array(2041013, 600, 1, 0), //披风力量卷轴60%
Array(2041014, 600, 1, 0), //披风力量卷轴10%
Array(2041016, 600, 1, 0), //披风智力卷轴60%
Array(2041017, 600, 1, 0), //披风智力卷轴10%
Array(2041019, 600, 1, 0), //披风敏捷卷轴60%
Array(2041020, 600, 1, 0), //披风敏捷卷轴10%
Array(2041022, 600, 1, 0), //披风运气卷轴60%
Array(2041023, 600, 1, 0), //披风运气卷轴10%
Array(2041042, 600, 1, 0), //披风魔法防御卷轴65%
Array(2041044, 600, 1, 0), //披风物理防御卷轴65%
Array(2041046, 600, 1, 0), //披风体力卷轴65%
Array(2041048, 600, 1, 0), //披风魔力卷轴65%
Array(2041050, 600, 1, 0), //披风力卷轴65%
Array(2041052, 600, 1, 0), //披风智力卷轴65%
Array(2041054, 600, 1, 0), //披风敏捷卷轴65%
Array(2041056, 600, 1, 0), //披风幸运卷轴65%
Array(2041058, 600, 1, 1), //披风防寒卷轴10%
Array(2041201, 600, 1, 1), //项链运气卷轴10%
Array(2041202, 600, 1, 1), //项链运气卷轴60%
Array(2041206, 600, 1, 1), //项链力量卷轴10%
Array(2041207, 600, 1, 1), //项链力量卷轴60%
Array(2041301, 600, 1, 1), //腰带力量卷轴60%
Array(2041304, 600, 1, 1), //腰带智力卷轴60%
Array(2041307, 600, 1, 1), //腰带敏捷卷轴60%
Array(2041310, 600, 1, 1), //腰带运气卷轴60%
Array(2043001, 600, 1, 0), //单手剑攻击卷轴60%
Array(2043002, 600, 1, 0), //单手剑攻击卷轴10%
Array(2043008, 600, 1, 0), //单手剑魔力卷轴10%
Array(2043009, 600, 1, 0), //单手剑魔力卷轴60%
Array(2043017, 600, 1, 0), //单手剑命中率卷轴60%
Array(2043019, 600, 1, 0), //单手剑命中率卷轴10%
Array(2043101, 600, 1, 0), //单手斧攻击卷轴60%
Array(2043102, 600, 1, 0), //单手斧攻击卷轴10%
Array(2043112, 400, 1, 0), //单手斧命中率卷轴60%
Array(2043114, 400, 1, 0), //单手斧命中率卷轴10%
Array(2043201, 400, 1, 0), //单手钝器攻击卷轴60%
Array(2043202, 400, 1, 0), //单手钝器攻击卷轴10%
Array(2043212, 400, 1, 0), //单手钝器命中率卷轴60%
Array(2043214, 400, 1, 0), //单手钝器命中率卷轴10%
Array(2043301, 600, 1, 0), //短剑攻击卷轴60%
Array(2043302, 600, 1, 0), //短剑攻击卷轴10%
Array(2043701, 600, 1, 0), //短杖魔力卷轴60%
Array(2043702, 600, 1, 0), //短杖魔力卷轴10%
Array(2043801, 600, 1, 0), //长杖魔力卷轴60%
Array(2043802, 600, 1, 0), //长杖魔力卷轴10%
Array(2044001, 600, 1, 1), //双手剑攻击卷轴60%
Array(2044002, 600, 1, 1), //双手剑攻击卷轴10%
Array(2044012, 600, 1, 0), //双手剑命中率卷轴60%
Array(2044014, 600, 1, 0), //双手剑命中率卷轴10%
Array(2044101, 600, 1, 0), //双手斧攻击卷轴60%
Array(2044102, 600, 1, 0), //双手斧攻击卷轴10%
Array(2044112, 600, 1, 0), //双手斧命中率卷轴60%
Array(2044114, 600, 1, 0), //双手斧命中率卷轴10%
Array(2044201, 600, 1, 0), //双手钝器攻击卷轴60%
Array(2044202, 600, 1, 0), //双手钝器攻击卷轴10%
Array(2044212, 600, 1, 0), //双手钝器命中率卷轴60%
Array(2044214, 600, 1, 0), //双手钝器命中率卷轴10%
Array(2044301, 600, 1, 1), //枪攻击卷轴60%
Array(2044302, 600, 1, 1), //枪攻击卷轴10%
Array(2044312, 600, 1, 0), //枪命中率卷轴60%
Array(2044314, 600, 1, 0), //枪命中率卷轴10%
Array(2044401, 600, 1, 1), //矛攻击卷轴60%
Array(2044402, 600, 1, 1), //矛攻击卷轴10%
Array(2044412, 600, 1, 0), //矛命中率卷轴60%
Array(2044414, 600, 1, 0), //矛命中率卷轴10%
Array(2044501, 600, 1, 0), //弓攻击卷轴60%
Array(2044502, 600, 1, 0), //弓攻击卷轴10%
Array(2044601, 600, 1, 0), //弩攻击卷轴60%
Array(2044602, 600, 1, 0), //弩攻击卷轴10%
Array(2044701, 600, 1, 0), //拳套攻击卷轴60%
Array(2044702, 600, 1, 0) //拳套攻击卷轴10%
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("#v4032226#你有吗？？");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.haveItem(4031191, 1)) {
			var itemt = "";
			for (var i = 0; i < itemList.length; i++) {
			itemt += "#v"+itemList[i][0]+"#";
			}
			itemt += "\r\n\r\n#v4031191#你好！这里是月妙副本[金铃铛]抽奖.1个铃铛抽奖一次哦！更有几率抽到[祝福卷轴]哦！抽取时请注意背包空间！这里主要抽取10%-60%的所有卷轴！祝您好运！";
            cm.sendYesNo(itemt);
           // cm.sendYesNo("#v4031191#你想要抽奖吗？？?");
        } else {
            cm.sendOk("你好！这里是月妙副本[金铃铛]抽奖.1个铃铛抽奖一次哦！更有几率抽到[祝福卷轴]哦！抽取时请注意背包空间！这里主要抽取10%-60%的所有卷轴！祝您好运！");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 600);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "月妙副本抽奖", notice);
            if (item != -1) {
                cm.gainItem(4031191, -1);
                cm.sendOk("恭喜你获得#b#t" + item + "##k " + quantity + "一个");
            } else {
                cm.sendOk("你好！这里是月妙副本[金铃铛]抽奖.1个铃铛抽奖一次哦！更有几率抽到[祝福卷轴]哦！抽取时请注意背包空间！这里主要抽取10%-60%的所有卷轴！祝您好运！");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("什么都没抽到 ,返还一个 #v4031191# 给你!.");
            cm.gainItem(4031191, -1);
            cm.gainItem(4031191, 1);
            cm.safeDispose();
        }
    }
}