status = -1;
var itemList = Array(
//-------耳环-------
Array(1032047, 800, 1, 1), //可乐耳环
Array(1032055, 800, 1, 1), //工作人员C的旧收信机
Array(1032056, 800, 1, 1), //工作人员C的旧收信机
Array(1032057, 800, 1, 1), //工作人员C的旧收信机
Array(1032058, 800, 1, 1), //工作人员C钛质收信机
Array(1012070, 800, 1, 1), //工作人员C钛质收信机
Array(1012071, 800, 1, 1), //工作人员C钛质收信机
Array(1012072, 800, 1, 1), //工作人员C钛质收信机
Array(1012073, 800, 1, 1), //工作人员C钛质收信机
//-------帽子-------
Array(1002418, 800, 1, 1), //废报纸头盔
Array(1002419, 800, 1, 1), //枫叶帽
Array(1002424, 800, 1, 1), //红马术帽
Array(1002425, 800, 1, 1), //蓝马术帽
Array(1002436, 800, 1, 1), //长老斯坦之帽
Array(1002554, 800, 1, 1), //武艺头绳
Array(1002677, 800, 1, 1), //玩具匠人帽
Array(1002699, 800, 1, 1), //南瓜帽子
Array(1002776, 200, 1, 1), //永恒冠军盔
Array(1002777, 200, 1, 1), //永恒玄妙帽
Array(1002778, 200, 1, 1), //永恒霓翎帽
Array(1002779, 200, 1, 1), //永恒迷踪帽
Array(1002780, 200, 1, 1), //永恒海王星
Array(1002790, 200, 1, 1), //重生冠军盔
Array(1002791, 200, 1, 1), //重生玄妙帽
Array(1002792, 200, 1, 1), //重生霓翎帽
Array(1002793, 200, 1, 1), //重生迷踪帽
Array(1002794, 200, 1, 1), //重生海王星
//------披风------
Array(1102040, 800, 1, 1), //浪人披风(黄)
Array(1102041, 800, 1, 1), //浪人披风(粉)
Array(1102042, 800, 1, 1), //浪人披风(紫)
Array(1102043, 800, 1, 1), //浪人披风(褐)
Array(1102046, 800, 1, 1), //侯爵披风
Array(1102047, 800, 1, 1), //伯爵披风
Array(1102048, 800, 1, 1), //公爵披风
Array(1102140, 800, 1, 1), //卡帕莱特披风
Array(1102147, 800, 1, 1), //玩具匠人披风
Array(1102172, 800, 1, 1), //永恒不灭披风
Array(1102174, 800, 1, 1), //工作人员披风
Array(1102166, 400, 1,1), //枫叶披风
Array(1102167, 800, 1, 1), //枫叶披风
Array(1102168, 800, 1, 1), //枫叶披风
Array(1402037, 500, 1, 1), //龙背刃
//------手套------
Array(1082145, 800, 1, 1), //工地手套(黄)
Array(1082146, 800, 1, 1), //工地手套(红)
Array(1082147, 800, 1, 1), //工地手套(蓝)
Array(1082148, 800, 1, 1), //工地手套(紫)
Array(1082149, 800, 1, 1), //工地手套(褐)
Array(1082150, 800, 1, 1), //工地手套(灰)
Array(1082175, 800, 1, 1), //马绍尔手套(赤)
Array(1082176, 800, 1, 1), //马绍尔手套(青)
Array(1082177, 800, 1, 1), //马绍尔手套(紫
Array(1082178, 800, 1, 1), //马绍尔手套(桃)
Array(1082179, 800, 1, 1), //马绍尔手套(黄)
Array(1082234, 200, 1, 1), //永恒定边手套
Array(1082235, 200, 1, 1), //永恒逍遥手套
Array(1082236, 200, 1, 1), //永恒白云手套
Array(1082237, 200, 1, 1), //永恒探云手套
Array(1082238, 200, 1, 1), //永恒抚浪手套
Array(1082239, 200, 1, 1), //重生定边手套
Array(1082240, 200, 1, 1), //重生逍遥手套
Array(1082241, 200, 1, 1), //重生白云手套
Array(1082242, 200, 1, 1), //重生探云手套
Array(1082243, 200, 1, 1), //重生抚浪手套
//-------武器------
Array(1302018, 800, 1, 1), //汤勺
Array(1302020, 800, 1, 1), //枫叶战剑
Array(1302021, 800, 1, 1), //橡皮榔头
Array(1302022, 800, 1, 1), //竹刀
Array(1302024, 800, 1, 1), //废报纸卷
Array(1302025, 800, 1, 1), //红雨伞
Array(1302026, 800, 1, 1), //黑雨伞
Array(1302027, 800, 1, 1), //绿雨伞
Array(1302028, 800, 1, 1), //紫雨伞
Array(1302029, 800, 1, 1), //褐雨伞
Array(1302030, 800, 1, 1), //枫叶剑
Array(1302035, 800, 1, 1), //枫叶旗
Array(1302036, 800, 1, 1), //枫叶旗
Array(1302058, 800, 1, 1), //冒险岛伞
Array(1302061, 800, 1, 1), //蔓藤鞭子
Array(1302063, 800, 1, 1), //燃烧的火焰刀
Array(1302064, 800, 1, 1), //枫叶突击剑
Array(1302066, 800, 1, 1), //枫叶3年旗
Array(1302067, 800, 1, 1), //枫叶庆典旗
Array(1302080, 800, 1, 1), //七彩霓虹灯泡
Array(1302081, 200, 1, 1), //永恒破甲剑
Array(1302084, 800, 1, 1), //火柴
Array(1302085, 800, 1, 1), //叉子
Array(1302086, 200, 1, 1), //重生破甲剑
Array(1302087, 800, 1, 1), //火炬
Array(1302104, 800, 1, 1), //鱿鱼剑
Array(1302105, 800, 1, 1), //圣诞六翼天使武器(单手剑)
Array(1312002, 800, 1, 1), //镰刀
Array(1312012, 800, 1, 1), //乾坤圈
Array(1312013, 800, 1, 1), //判官笔
Array(1312014, 800, 1, 1), //阎王笔
Array(1312032, 800, 1, 1), //枫叶破击斧
Array(1312033, 800, 1, 1), //枫叶3年旗
Array(1312034, 800, 1, 1), //粉色花边游泳圈
Array(1312037, 200, 1, 1), //永恒断蚺斧
Array(1312038, 200, 1, 1), //重生断蚺斧
Array(1312039, 800, 1, 1), //圣诞六翼天使武器(单手斧)
Array(1322009, 800, 1, 1), //马桶吸
Array(1322027, 800, 1, 1), //米伽勒的平底锅
Array(1322051, 800, 1, 1), //七夕
Array(1322052, 800, 1, 1), //狂龙地锤
Array(1322054, 800, 1, 1), //枫叶地震锤
Array(1322055, 800, 1, 1), //枫叶3年旗
Array(1322056, 800, 1, 1), //粉色花边游泳圈
Array(1322060, 200, 1, 1), //永恒惊破天
Array(1322061, 200, 1, 1), //重生惊破天
Array(1322065, 800, 1, 1), //圣诞六翼天使武器(单手钝器)
Array(1322071, 800, 1, 1), //采矿铁锹
Array(1332052, 800, 1, 1), //阴风碎魂刃
Array(1332053, 800, 1, 1), //野外烧烤串
Array(1332055, 800, 1, 1), //枫叶锁魄铗
Array(1332056, 800, 1, 1), //枫叶追魂刺
Array(1332057, 800, 1, 1), //枫叶3年旗
Array(1332059, 800, 1, 1), //粉色花边游泳圈
Array(1332073, 200, 1, 1), //永恒狂鲨锯
Array(1332074, 200, 1, 1), //永恒断首刃
Array(1332075, 200, 1, 1), //重生狂鲨锯
Array(1332076, 200, 1, 1), //重生断首刃
Array(1332081, 800, 1, 1), //圣诞六翼天使武器(短剑)
Array(1372044, 200, 1, 1), //永恒蝶翼杖
Array(1372045, 200, 1, 1), //重生蝶翼杖
Array(1372046, 800, 1, 1), //圣诞六翼天使武器(短杖)
Array(1382015, 800, 1, 1), //毒蘑菇
Array(1382016, 800, 1, 1), //香菇
Array(1382037, 800, 1, 1), //偃月之杖
Array(1382049, 800, 1, 1), //朱雀长杖
Array(1382050, 800, 1, 1), //玄武长杖
Array(1382051, 800, 1, 1), //白虎长杖
Array(1382052, 800, 1, 1), //青龙长杖
Array(1382057, 200, 1, 1), //永恒冰轮杖
Array(1382059, 200, 1, 1), //重生冰轮杖
Array(1382062, 800, 1, 1), //圣诞六翼天使武器(长杖)
Array(1402013, 800, 1, 1), //白日剑
Array(1402014, 200, 1, 1), //温度计
Array(1402044, 800, 1, 1), //南瓜灯笼
Array(1402046, 200, 1, 1), //永恒玄冥剑
Array(1402047, 200, 1, 1), //重生玄冥剑
Array(1402053, 800, 1, 1), //圣诞六翼天使武器(双手剑)
Array(1412027, 800, 1, 1), //枫叶乾坤轮
Array(1412028, 800, 1, 1), //枫叶3年旗
Array(1412033, 200, 1, 1), //永恒碎鼋斧
Array(1412034, 200, 1, 1), //重生碎鼋斧
Array(1422030, 800, 1, 1), //粉红海豹抱枕
Array(1422031, 800, 1, 1), //蓝色海豹抱枕
Array(1422032, 800, 1, 1), //枫叶3年旗
Array(1422033, 800, 1, 1), //粉色花边游泳圈
Array(1422036, 800, 1, 1), //玩具匠人的锤子
Array(1422037, 200, 1, 1), //永恒威震天
Array(1422038, 200, 1, 1), //重生威震天
Array(1422039, 800, 1, 1), //圣诞六翼天使武器(双手钝器)
Array(1432035, 800, 1, 1), //奥丁手戟
Array(1432037, 800, 1, 1), //枫叶大将旗
Array(1432038, 800, 1, 1), //盘龙七冲枪
Array(1432039, 800, 1, 1), //钓鱼竿
Array(1432040, 800, 1, 1), //枫叶钻天枪
Array(1432041, 800, 1, 1), //枫叶3年旗
Array(1432042, 800, 1, 1), //粉色花边游泳圈
Array(1432046, 800, 1, 1), //圣诞树手杖
Array(1432047, 200, 1, 1), //永恒显圣枪
Array(1432048, 800, 1, 1), //铲子
Array(1432049, 200, 1, 1), //重生显圣枪
Array(1432050, 800, 1, 1), //圣诞六翼天使武器(枪)
Array(1442018, 800, 1, 1), //冻冻鱼
Array(1442021, 800, 1, 1), //黄拖把
Array(1442022, 800, 1, 1), //白拖把
Array(1442023, 800, 1, 1), //黑拖把
Array(1442025, 800, 1, 1), //青龙偃月刀
Array(1442026, 800, 1, 1), //红色冲浪板
Array(1442027, 800, 1, 1), //绿色冲浪板
Array(1442028, 800, 1, 1), //蓝色冲浪板
Array(1442029, 800, 1, 1), //紫色冲浪板
Array(1442030, 800, 1, 1), //枫之雪板
Array(1442039, 200, 1, 1), //冻冻鱼
Array(1442044, 800, 1, 1), //战魂斗杀戟
Array(1442046, 800, 1, 1), //超级滑雪板
Array(1442051, 800, 1, 1), //枫叶强袭斧
Array(1442052, 800, 1, 1), //枫叶3年旗
Array(1442054, 800, 1, 1), //红色滑水板
Array(1442055, 800, 1, 1), //绿色滑水板
Array(1442056, 800, 1, 1), //蓝色滑水板
Array(1442057, 800, 1, 1), //紫色滑水板
Array(1442063, 800, 1, 1), //永恒神光戟
Array(1442065, 800, 1, 1), //蓝色冲浪板
Array(1442066, 800, 1, 1), //红色冲浪板
Array(1442067, 800, 1, 1), //重生神光戟
Array(1442069, 800, 1, 1), //红色冲浪板
Array(1442070, 800, 1, 1), //绿色冲浪板
Array(1442071, 800, 1, 1), //圣诞六翼天使武器(矛)
Array(1452045, 800, 1, 1), //枫叶HAPPY弓
Array(1452046, 800, 1, 1), //枫叶3年旗
Array(1452057, 200, 1, 1), //永恒惊电弓
Array(1452059, 200, 1, 1), //重生惊电弓
Array(1452062, 800, 1, 1), //圣诞六翼天使武器(弓)
Array(1462050, 200, 1, 1), //永恒冥雷弩
Array(1462051, 200, 1, 1), //重生冥雷弩
Array(1462040, 800, 1, 1), //枫叶击星弩
Array(1462041, 800, 1, 1), //枫叶3年旗
Array(1462050, 200, 1, 1), //永恒冥雷弩
Array(1462051, 200, 1, 1), //重生冥雷弩
Array(1462056, 800, 1, 1), //圣诞六翼天使武器(弩)
Array(1472055, 800, 1, 1), //枫叶定天拳
Array(1472056, 800, 1, 1), //枫叶3年旗
Array(1472068, 200, 1, 1), //永恒大悲赋
Array(1472071, 200, 1, 1), //重生大悲赋
Array(1472077, 800, 1, 1), //圣诞六翼天使武器(拳套)
Array(1482023, 200, 1, 1), //永恒孔雀翎
Array(1482024, 200, 1, 1), //重生孔雀翎
Array(1492023, 800, 1, 1), //永恒凤凰铳
Array(1492025, 200, 1, 1), //重生凤凰铳
Array(1492026, 800, 1, 1), //粉色花边游泳圈
Array(1492030, 800, 1, 1), //圣诞六翼天使武器(手枪)
Array(1492034, 800, 1, 1), //枫叶3年旗
Array(1302075, 800, 1, 1), //新加坡国旗（单手剑）
Array(1302076, 800, 1, 1), //马来西亚国旗（单手剑）
Array(1312035, 800, 1, 1), //新加坡国旗（单手斧）
Array(1312036, 800, 1, 1), //马来西亚国旗（单手斧）
Array(1322057, 800, 1, 1), //新加坡国旗（单手杖）
Array(1322058, 800, 1, 1), //马来西亚国旗（单手杖）
Array(1332060, 800, 1, 1), //新加坡国旗（短剑）
Array(1332061, 800, 1, 1), //马来西亚国旗（短剑）
Array(1382043, 800, 1, 1), //新加坡国旗（长杖）
Array(1382044, 800, 1, 1), //马来西亚国旗（长杖）
Array(1402042, 800, 1, 1), //新加坡国旗（双手剑）
Array(1412030, 800, 1, 1), //新加坡国旗（双手斧）
Array(1412031, 800, 1, 1), //马来西亚国旗（双手斧）
Array(1422034, 800, 1, 1), //新加坡国旗（双手杖）
Array(1432043, 800, 1, 1), //新加坡国旗（枪）
Array(1432044, 800, 1, 1), //马来西亚国旗（枪）
Array(1442058, 800, 1, 1), //新加坡国旗（矛）
Array(1452049, 800, 1, 1), //新加坡国旗（弓）
Array(1452050, 800, 1, 1), //马来西亚国旗（弓）
//------药水------
Array(1382013, 800, 1, 1), //烈焰之杖
Array(1382015, 800, 1, 1), //毒蘑菇
Array(1382037, 800, 1, 1), //偃月之杖		
Array(1002894, 800, 1, 1), //粉色编织发带
Array(1002895, 800, 1, 1), //红色编织发带
Array(1002896, 800, 1, 1), //紫色编织发带
Array(1002897, 800, 1, 1), //橙色编织发带
Array(1002898, 800, 1, 1), //绿色编织发带
Array(1002899, 800, 1, 1), //黄色编织发带
Array(1002900, 800, 1, 1), //蓝色编织发带
Array(1002914, 800, 1, 1), //盖福克斯的帽子(力量)
Array(1002915, 800, 1, 1), //盖福克斯的帽子(敏捷)
Array(1002916, 800, 1, 1), //盖福克斯的帽子(智力)
Array(1002917, 800, 1, 1), //盖福克斯的帽子(幸运)
Array(1132000, 800, 1, 1), //白色腰带
Array(1132001, 800, 1, 1), //黄色腰带
Array(1132002, 800, 1, 1), //蓝色腰带
Array(1132003, 800, 1, 1), //红色腰带
Array(1132004, 800, 1, 1), //黑贺腰带
Array(1132012, 800, 1, 1), //法老的腰带
Array(1132013, 800, 1, 1), //不灭的法老腰带
Array(1012011, 800, 1, 1), //圣诞鹿的鼻子
Array(1012012, 800, 1, 1), //圣诞鹿的鼻子
Array(1012013, 800, 1, 1), //圣诞鹿的鼻子
Array(1012014, 800, 1, 1), //圣诞鹿的鼻子
Array(1012015, 800, 1, 1), //圣诞鹿的鼻子
Array(1012016, 800, 1, 1), //圣诞鹿的鼻子
Array(1012017, 800, 1, 1), //圣诞鹿的鼻子
Array(1012018, 800, 1, 1), //圣诞鹿的鼻子
Array(1012019, 800, 1, 1), //圣诞鹿的鼻子
Array(1012020, 800, 1, 1), //圣诞鹿的鼻子
Array(1012056, 800, 1, 1), //狗狗鼻
Array(1012058, 800, 1, 1), //匹诺曹的鼻子
Array(1012059, 800, 1, 1), //匹诺曹的鼻子
Array(1012060, 800, 1, 1), //匹诺曹的鼻子
Array(1012061, 800, 1, 1), //匹诺曹的鼻子
Array(1032031, 800, 1, 1), //永恒金盾坠
Array(1122001, 800, 1, 1), //绿色蝶形领结
Array(1122002, 800, 1, 1), //红色蝶形领结
Array(1122003, 800, 1, 1), //黄色蝶形领结
Array(1122004, 800, 1, 1), //粉红蝶形领结
Array(1122005, 800, 1, 1), //黑色蝶形领结
Array(1122006, 800, 1, 1), //蓝色蝶形领结
Array(1122015, 800, 1, 1), //枫叶围巾
Array(1122058, 800, 1, 1), //休彼德蔓的混沌项链
Array(1132002, 800, 1, 1), //蓝色腰带
Array(1132003, 800, 1, 1), //红色腰带
Array(1132004, 800, 1, 1), //黑贺腰带
Array(1132010, 800, 1, 1), //黄金猪猪腰带
Array(1132011, 800, 1, 1), //黄金猪猪腰带
Array(1132012, 800, 1, 1), //法老的腰带
Array(1132013, 800, 1, 1), //不灭的法老腰带
Array(1122074, 800, 1, 1), //枫叶吊坠
Array(1122075, 800, 1, 1), //黄金枫叶魔法吊坠
Array(1002390, 800, 1, 1), //真扎昆头盔
Array(1002391, 800, 1, 1), //海盗头巾(绿)
Array(1002392, 800, 1, 1), //海盗头巾(红)
Array(1002393, 800, 1, 1), //海盗头巾(粉)
Array(1002394, 800, 1, 1), //海盗头巾(灰)
Array(1002395, 800, 1, 1), //海盗头巾(紫)
Array(1002418, 800, 1, 1), //废报纸头盔
Array(1002419, 800, 1, 1), //枫叶帽
Array(1002424, 800, 1, 1), //红马术帽
Array(1002425, 800, 1, 1), //蓝马术帽
Array(1002441, 800, 1, 1), //热血头带
Array(1002508, 800, 1, 1), //枫叶头盔
Array(1002509, 800, 1, 1), //枫叶头盔
Array(1002510, 800, 1, 1), //枫叶头盔
Array(1002511, 800, 1, 1), //枫叶头盔
Array(1002547, 800, 1, 1), //红猎人帽子
Array(1002551, 800, 1, 1), //蓝龙头盔
Array(1002554, 800, 1, 1), //武艺头绳
//-----椅子-----
Array(3010013, 800, 1, 1), //悠长假期
Array(3010014, 800, 1, 1), //月亮弯
Array(3010018, 800, 1, 1), //椰子树沙滩椅
Array(3010019, 800, 1, 1), //寿司椅
Array(3010021, 800, 1, 1), //暖暖桌
Array(3010025, 800, 1, 1), //枫叶纪念凳
Array(3010028, 800, 1, 1), //海盗的俘虏
Array(3010029, 800, 1, 1), //蓝环凳
Array(3010030, 800, 1, 1), //黑环凳
Array(3010031, 800, 1, 1), //红环凳
Array(3010032, 800, 1, 1), //黄环凳
Array(3010033, 800, 1, 1), //绿环凳
Array(3010037, 800, 1, 1), //猪猪凳
Array(3010044, 800, 1, 1), //同一红伞下
Array(3012001, 800, 1, 1), //篝火
Array(3012002, 800, 1, 1), //浴桶
Array(3010073, 800, 1, 1), //PB克缤
Array(3012003, 800, 1, 1), //爱心椅子
Array(3010012, 800, 1, 1), //剑士 宝座
Array(3010025, 800, 1, 1), //枫叶纪念凳
Array(3010037, 800, 1, 1), //猪猪凳
Array(3010038, 800, 1, 1), //爱心椅子
Array(3010040, 800, 1, 1), //蝙蝠椅
Array(3010041, 800, 1, 1), //骷髅王座
Array(3010043, 800, 1, 1), //魔女的飞扫把
Array(3010044, 800, 1, 1), //同一红伞下
Array(3010045, 800, 1, 1), //寒冰椅子
Array(3010046, 800, 1, 1), //红龙椅
Array(3010047, 800, 1, 1), //蓝龙椅
Array(3010048, 800, 1, 1), //圣诞树椅子
Array(3010049, 800, 1, 1), //雪房子
Array(3010050, 800, 1, 1), //公主凳
Array(3010057, 800, 1, 1), //血色玫瑰
Array(3010058, 800, 1, 1), //世界末日
Array(3010068, 800, 1, 1), //露水椅子
Array(3010070, 800, 1, 1), //巨无霸品克缤
Array(3010071, 800, 1, 1), //神兽椅
Array(3010077, 800, 1, 1), //猫头鹰椅子
Array(3010085, 800, 1, 1), //鬼娃娃椅子
Array(3010096, 800, 1, 1), //恐龙化石宝座
Array(3010095, 800, 1, 1), //石头人座椅
Array(3010094, 800, 1, 1), //漂漂猪椅子
Array(3010098, 800, 1, 1), //电视宅人
Array(3010106, 800, 1, 1), //雪狼战椅
Array(3010112, 800, 1, 1)
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        if (cm.getHyPay(4) >= 10) {
            cm.sendYesNo("冒险岛积分中有各类#b装备、卷轴或稀有新奇的道具#k噢！使用“#b10积分#k”就可以交换. 游戏商城中的“其他”－“游戏”区里有噢。现在要玩转蛋机么? ");
        } else {
            cm.sendOk("你有10点消费积分吗?");
            cm.safeDispose();
        }
    } else if (status == 1) {
        var chance = Math.floor(Math.random() * 1000);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "10点消费积分整合型转蛋机", notice);
            if (item != -1) {
                cm.delPayReward(10);
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("你确实有#b#10点消费积分#k吗？如果是，请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：#v5220040#x3。)");
                cm.delPayReward(10);
            cm.gainItem(5220040, 2);
            cm.safeDispose();
        }
    }
}