function start() {
    status = -1;

    action(1, 0, 0);
}
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    }
    else {
        if (status >= 0 && mode == 0) {

            cm.sendOk("感谢你的光临！");
            cm.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        }
        else {
            status--;
        }
        if (status == 0) {
            var tex2 = "";
            var text = "";
            for (i = 0; i < 10; i++) {
                text += "";
            }
			//显示物品ID图片用的代码是  #v这里写入ID#
            text += "#e#r累积充值达到1000礼包，可获得：#n#b\r\n1、祝福*混沌各15张\r\n2、皇家理发卷*10张\r\n3、绝对之戒*1个（全属性+10、攻击/魔攻+10、血/蓝+300、防御、魔防、回避、命中+50）\r\n4、浪人披风+7（攻击+21或者魔攻+21）\r\n5、桑拿服+10（主属性+50）\r\n6、100级本职业武器+7\r\n7、回收精灵吊坠，并且在精灵吊坠上面+5G、+5魔攻\r\n8、高级贝勒耳环*1 （四维+15、攻击+10、魔攻+10）\r\n9、安全帽+7（21攻或者21魔攻）\r\n10、任选小椅子一张\r\n11、冒险岛=3000万\r\n12、勋章一枚（全属性+30、攻击/魔攻+30、移动/跳跃+20、血/蓝+3000、防御、魔防、回避、命中+100）\r\n#r领取礼包必须要有足够的空间哦，否则被系统吞了东西，管理员不负责哦\r\n"//3
            text += "#L1##r#v4310011#领取累计充值1000礼包#l\r\n\r\n"//3
            cm.sendSimple(text);
        } else if (selection == 1) {
                      if(!cm.canHold(1112793,1)){
			cm.sendOk("请清理你的背包，至少空出2个位置！");
            cm.dispose();
        } else if(cm.haveItem(4310011,1)){
				cm.gainItem(4310011, -1);
				cm.gainItem(5150040, 10);//皇家
				cm.gainItem(2049100, 15);//祝福
				cm.gainItem(2340000, 15);//混沌
				cm.gainItem(1113077,10,10,10,10,300,300,10,10,50,50,50,50,0,0);//绝对之戒
				cm.gainItem(1032222,15,15,15,15,50,50,10,10,0,0,50,50,0,0);//高级贝勒耳环
				cm.gainItem(1142219,30,30,30,30,3000,3000,30,30,100,100,100,100,20,20);//勋章一枚
				cm.gainItem(1122017,0,0,0,0,0,0,5,5,0,0,0,0,0,0);//精灵吊坠
				cm.gainMeso(30000000);
            cm.sendOk("领取成功，浪人披风+7、桑拿服+10、100级本职业武器+7、安全帽+7、任选小椅子一张必须找管理员获得！");
cm.喇叭(2, "恭喜[" + cm.getPlayer().getName() + "]成功领取累积充值礼包3！！");
            cm.dispose();
			}else{
            cm.sendOk("你的充值达不到限度，或者你已经领取过了，请勿重复领取！");
            cm.dispose();
			}
		}
    }
}


