status = -1;
var itemList = Array(
// ------ 椅子 ------
Array(3010044, 700, 1, 1), //同一红伞下
Array(3012002, 700, 1, 1), //浴桶
Array(3012003, 700, 1, 1), //爱心椅子
Array(3010038, 700, 1, 1), //爱心椅子
Array(3010043, 700, 1, 1), //魔女的飞扫把
Array(3010046, 700, 1, 1), //红龙椅
Array(3010047, 700, 1, 1), //蓝龙椅
Array(3010048, 700, 1, 1), //圣诞树椅子
Array(3010050, 700, 1, 1), //公主凳
// ------ 卷轴 ------
Array(2043002, 600, 1, 1), //单手剑攻击卷轴10%
Array(2043008, 600, 1, 1), //单手剑魔力卷轴10%
Array(2044002, 600, 1, 1), //双手剑攻击卷轴10%
Array(2043202, 600, 1, 1), //单手钝器攻击卷轴10%
Array(2044202, 600, 1, 1), //双手钝器攻击卷轴10%
Array(2043102, 600, 1, 1), //单手斧攻击卷轴10%
Array(2044102, 600, 1, 1), //双手斧攻击卷轴10%
Array(2044302, 600, 1, 1), //枪攻击卷轴10%
Array(2044402, 600, 1, 1), //矛攻击卷轴10%
Array(2043702, 600, 1, 1), //短杖魔力卷轴10%
Array(2043802, 600, 1, 1), //长杖魔力卷轴10%
Array(2044502, 600, 1, 1), //弓攻击卷轴10%
Array(2044602, 600, 1, 1), //弩攻击卷轴10%
Array(2044702, 600, 1, 1), //拳套攻击卷轴10%
Array(2043302, 600, 1, 1), //短剑攻击卷轴10%
Array(2043402, 600, 1, 1), //刀攻击力卷轴 10%
Array(2044902, 600, 1, 1), //短枪攻击卷轴10%
Array(2044802, 600, 1, 1), //拳甲攻击卷轴10%
Array(2040915, 600, 1, 1), //盾牌攻击卷轴10%
Array(2040920, 600, 1, 1), //盾牌魔力卷轴10%
Array(2049116, 600, 1, 1), //强化混沌卷轴
Array(2340000, 500, 1, 1), //祝福卷轴
Array(2049004, 500, 1, 1), //白医卷轴—仙
Array(2049300, 500, 1, 1), //高级装备强化卷轴
Array(2049400, 500, 1, 1), //高级潜能附加卷轴
Array(2049304, 500, 1, 1), //3星装备强化卷轴
Array(2049309, 500, 1, 1), //2星装备强化卷轴
Array(2290285, 700, 1, 1), //神秘能手册
// ------ 装备 ------
Array(1112586, 500, 1, 1), //黑天使的祝福
Array(1202004, 500, 1, 1), //诅咒僵尸-图腾
Array(1202024, 400, 1, 1), //金·乔图腾
Array(1202025, 500, 1, 1), //银·乔图腾
Array(1202028, 400, 1, 1), //金·海丽蜜图腾
Array(1202029, 500, 1, 1), //银·海丽蜜图腾
Array(1202032, 400, 1, 1), //金·小龙图腾
Array(1202033, 500, 1, 1), //银·小龙图腾
Array(1202036, 400, 1, 1), //金·李卡司图腾
Array(1202037, 500, 1, 1), //银·李卡司图腾
Array(1132085, 400, 1, 1), //旭日腰带
Array(1132013, 700, 1, 1), //不灭的法老腰带
Array(1032102, 500, 1, 1), //完整的莱克斯绿色耳环
Array(1032103, 500, 1, 1), //完整的莱克斯红色耳环
Array(1032104, 500, 1, 1), //完整的莱克斯蓝色耳环
Array(1132091, 500, 1, 1), //十字旅团基本腰带
Array(1102041, 700, 1, 1), //浪人披风(粉)
Array(1102042, 700, 1, 1), //浪人披风(紫)
Array(1012319, 700, 1, 1), //8周年点点红
Array(1152054, 700, 1, 1), //完成的护肩
Array(1032026, 700, 1, 1), //黄水晶耳环
// ------ 特殊 ------
Array(5062000, 500, 1, 1), //神奇魔方
Array(4031997, 700, 1, 1), //蘑菇金币
Array(5064000, 500, 1, 1), //防爆卷轴
Array(5064100, 400, 1, 1), //保护卷轴
Array(2022800, 700, 1, 1), //心跳停止糖
Array(4031996, 400, 1, 1), //蘑菇铜牌
Array(4310015, 700, 1, 1), //斗神证物
Array(4021012, 700, 1, 1), //强烈灵魂的净水
Array(4021011, 700, 1, 1), //纯洁灵魂的火花
Array(5220040, 500, 1, 1), //冒险岛转蛋券
Array(5570000, 500, 1, 1), //金锤子
Array(5150040, 500, 1, 1), //皇家理发券
Array(5062002, 500, 1, 1), //高级神奇魔方
// ------ 玩具 ------
Array(1302087, 700, 1, 1), //火炬
Array(1422011, 700, 1, 1), //酒瓶
Array(1402029, 700, 1, 1), //鬼刺狼牙棒
Array(1302063, 700, 1, 1), //燃烧的火焰刀
// ------ 任务物品 ------
Array(4032177, 500, 1, 1), //褪色的冒险之心项坠
Array(4001226, 500, 1, 1), //褪色的勇气之心
Array(4001227, 500, 1, 1), //褪色的智慧之心
Array(4001228, 500, 1, 1), //褪色的精准之心
Array(4001229, 500, 1, 1), //褪色的敏捷之心
Array(4001230, 500, 1, 1), //褪色的自由之心
Array(4001563, 300, 1, 1), //特殊项链
Array(4033001, 300, 1, 1), //冒险之心的项坠
Array(4001558, 100, 1, 1), //勇气之心
Array(4001559, 100, 1, 1), //智慧之心
Array(4001560, 100, 1, 1), //精准之心
Array(4001561, 100, 1, 1), //敏捷之心
Array(4001562, 100, 1, 1) //自由之心
);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 700);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "明日礼物箱子(银)", notice);
            if (item != -1) {
            im.gainItem(2430639, -1);
                im.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                im.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            im.safeDispose();
        } else {
            im.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：运动会币 x3。)");
            im.gainItem(4310030, 3);
            im.safeDispose();
        }
    }
}