status = -1;
var itemList;
var random = java.lang.Math.floor(Math.random() * 7 + 1);
if(random == 1){
itemList = Array(
// ------ 卷轴 ------
Array(2049100, 500, 1, 3), //混沌卷轴60%
Array(4310030, 500, 1, 3), //运动会币
Array(1252062, 300, 1, 3), //布莱克缤魔法棒
Array(1532089, 300, 1, 3), //布莱克缤火炮
Array(1522085, 100, 1, 3), //布莱克缤双弩枪
Array(1492170, 300, 1, 3), //布莱克缤短枪
Array(1482159, 300, 1, 3), //布莱克缤指节
Array(1472205, 100, 1, 3), //布莱克缤拳套
Array(1462184, 300, 1, 3), //布莱克缤弩
Array(1452196, 300, 1, 3), //布莱克缤弓
Array(1442209, 300, 1, 3), //布莱克缤长矛
Array(1432158, 100, 1, 3), //布莱克缤长枪
Array(1422129, 100, 1, 3), //布莱克缤双手钝器
Array(1412126, 300, 1, 3), //布莱克缤双手斧
Array(1402185, 100, 1, 3), //布莱克缤双手剑
Array(1382199, 300, 1, 3), //布莱克缤长杖
Array(1372168, 300, 1, 3), //布莱克缤短杖
Array(1362081, 300, 1, 3), //布莱克缤手杖
Array(1342079, 300, 1, 3), //布莱克缤双刀
Array(1332214, 100, 1, 3), //布莱克缤短刀
Array(1322100, 300, 1, 3), //布莱克缤单手钝器
Array(1312142, 300, 1, 3), //布莱克缤单手斧
Array(1212072, 100, 1, 3), //布莱克缤双头杖
Array(1222067, 300, 1, 3), //布莱克缤灵魂手铳
Array(1232064, 100, 1, 3), //布莱克缤亡命剑
Array(1242069, 300, 1, 3), //布莱克缤能量剑
Array(1242070, 300, 1, 3), //布莱克缤能量剑
Array(1302070, 300, 1, 3), //布莱克缤单手剑
Array(2048052, 500, 1, 3), //宠物装备攻击力卷轴 40%
Array(2048052, 500, 1, 3), //宠物装备魔力卷轴 40%
Array(2531001, 500, 1, 3), //防爆卷轴
Array(2040811, 500, 1, 3), //手套攻击诅咒卷轴
Array(2040807, 500, 1, 3), //手套攻击诅咒卷轴
Array(2340000, 500, 1, 3), //祝福卷轴
Array(2046319, 500, 1, 3), //饰品魔力卷轴
Array(2040814, 500, 1, 3), //手套魔力诅咒卷轴70%
Array(2040815, 500, 1, 3), //手套魔力诅咒卷轴30%
Array(2048026, 500, 1, 3), //宠物装备攻击力卷轴
Array(2048027, 500, 1, 3), //宠物装备魔法攻击力卷轴
Array(2049300, 500, 1, 3), //高级装备强化卷轴
Array(2049700, 500, 1, 3), //A级潜能卷轴
Array(2049701, 500, 1, 3), //A级潜能卷轴
Array(2040917, 500, 1, 3), //盾牌攻击诅咒卷轴30%
Array(2040922, 500, 1, 3), //盾牌魔力诅咒卷轴30%
Array(2040852, 500, 1, 3), //品克缤手套攻击力卷轴
Array(2040853, 500, 1, 3), //品克缤手套攻击力卷轴
Array(2049132, 500, 1, 3), //惊人混沌卷轴30%
Array(2045004, 500, 1, 3), //白医卷轴—仙
Array(2045005, 500, 1, 3), //白医卷轴—神
Array(2049012, 500, 1, 3), //诅咒白医卷轴
Array(2045000, 500, 1, 3), //白医卷轴
Array(2045001, 500, 1, 3), //白医卷轴
Array(2045002, 500, 1, 3), //白医卷轴
Array(2049122, 500, 1, 3)  //正向混沌卷
);
} else if(random == 2){
itemList = Array(
// ------ 药品 ------
Array(2022956, 500, 1, 3), //火红玫瑰
Array(5121003, 500, 1, 3), //参鸡汤
Array(4310030, 500, 1, 3), //运动会币
Array(5121004, 500, 1, 3), //松糕  
Array(5121005, 500, 1, 3), //韩果  
Array(5121006, 500, 1, 3), //小魔女  
Array(5121007, 500, 1, 3), //圣诞树铃铛  
Array(5121008, 500, 1, 3), //祝你生日快乐  
Array(5121009, 500, 1, 3), //火红玫瑰  
Array(5121010, 500, 1, 3), //浪漫樱花  
Array(5121015, 500, 1, 3), //雪孩子  
Array(5121016, 500, 1, 3), //巧克力糖果  
Array(5121020, 500, 1, 3), //喜洋洋  
Array(5121025, 500, 1, 3), //2010胜利祈愿 
Array(5122000, 500, 1, 3), //熊宝宝
Array(2210120, 500, 1, 3), //希拉变身药水
Array(2210121, 500, 1, 3), //麦格纳斯变身药水
Array(2210122, 500, 1, 3), //班·雷昂变身药水
Array(2210123, 500, 1, 3), //阿卡伊勒变身药水
Array(2022530, 500, 1, 3)  //迎春花花语
);
} else if(random == 3){
itemList = Array(
// ------ 坐骑 ------
Array(2430580, 500, 1, 3), // - 熊猫3天交换券
Array(4310030, 500, 1, 3), //运动会币
Array(2430582, 500, 1, 3), // - 透明蝙蝠怪3天交换券
Array(2430583, 500, 1, 3), // - 天马3天交换券 
Array(2430584, 500, 1, 3), //  - 热气球3天交换券
Array(2430585, 500, 1, 3), // - 企鹅3天交换券
Array(2430586, 500, 1, 3), //  - 骑士团战车3天交换券
Array(2430587, 500, 1, 3), // - 妮娜的魔法阵3天交换券
Array(2430588, 500, 1, 3), // - 拿破仑的白马3天交换券 
Array(2430589, 500, 1, 3), //  - 魔法扫帚3天交换券 
Array(2430590, 500, 1, 3), // - 梦魇3天交换券
Array(2430591, 500, 1, 3), // - 猫头鹰3天交换券
Array(2430592, 500, 1, 3), // - 莱格斯的豺犬3天交换券 
Array(2430593, 500, 1, 3), // - 警车3天交换券
Array(2430603, 500, 1, 3)  //蝙蝠怪1天使用券
);
} else if(random == 4){
itemList = Array(
// ------ 称号 ------
Array(3700031, 500, 1, 3), //见习猎人资格证
Array(4310030, 500, 1, 3), //运动会币
Array(3700032, 500, 1, 3), //B级猎人资格证
Array(3700033, 500, 1, 3), //A级猎人资格证
Array(3700034, 500, 1, 3), //S级猎人资格证
Array(3700035, 500, 1, 3), //甜蜜情人节！
Array(3700036, 500, 1, 3), //情人节的糖果真甜
Array(3700037, 500, 1, 3), //枫树管理员
Array(3700039, 500, 1, 3), //打架王
Array(3700040, 500, 1, 3), //复仇者
Array(3700041, 500, 1, 3), //拥有虚弱魅力的人
Array(3700042, 500, 1, 3), //斗士
Array(3700043, 500, 1, 3), //最强斗士
Array(3700044, 500, 1, 3), //我最受欢迎
Array(3700045, 500, 1, 3), //我也很受欢迎
Array(3700046, 500, 1, 3), //我也挺受欢迎
Array(3700047, 500, 1, 3), //角斗士
Array(3700048, 500, 1, 3), //平定战场的人
Array(3700049, 500, 1, 3), //与末日风暴同在的
Array(3700053, 500, 1, 3), //中秋动物农场
Array(3700054, 500, 1, 3), //LTE 尤茨 
Array(3700055, 500, 1, 3), //双倍双倍
Array(3700056, 500, 1, 3), //落火
Array(3700057, 500, 1, 3), //谁会成为猪呢
Array(3700058, 500, 1, 3), //告别尤茨游戏菜鸟水平
Array(3700059, 500, 1, 3), //坚持尤茨游戏
Array(3700060, 500, 1, 3), //尤茨特殊人才
Array(3700061, 500, 1, 3), //武陵巨熊
Array(3700062, 500, 1, 3), //神木村飞龙
Array(3700063, 500, 1, 3), //班·雷昂狮子
Array(3700064, 500, 1, 3), //克里塞巨人
Array(3700065, 500, 1, 3), //万神殿英雄
Array(3700066, 500, 1, 3), //乌山老虎
Array(3700067, 500, 1, 3), //奥尔卡双胞胎
Array(3700068, 500, 1, 3), //射手村老鹰
Array(3700073, 500, 1, 3), //开路先锋
Array(3700074, 500, 1, 3), //熊的力量
Array(3700075, 500, 1, 3), //尼浩玛
Array(3700076, 500, 1, 3), //哭哭狸
Array(3700077, 500, 1, 3), //光舞 
Array(3700079, 500, 1, 3), //我是动作英雄
Array(3700080, 500, 1, 3), //这才是高手
Array(3700081, 500, 1, 3), //欢迎任何人来和我对决 
Array(3700082, 500, 1, 3), //不要放弃
Array(3700083, 500, 1, 3), //冒险岛酷暑
Array(3700084, 500, 1, 3), //夏天就该吃冰激凌
Array(3700085, 500, 1, 3), //拼图收藏家
Array(3700086, 500, 1, 3), //今天满勤
Array(3700087, 500, 1, 3), //喜欢红色
Array(3700088, 500, 1, 3)  //恶魔复仇者成就达成
);
} else if(random == 5){
itemList = Array(
// ------ 椅子 ------
Array(3063000, 500, 1, 3), // [A] 星岩 (力量)
Array(3063001, 500, 1, 3), // [A] 星岩 (力量)
Array(3063010, 500, 1, 3), // [A] 星岩 (敏捷)
Array(3063011, 500, 1, 3), // [A] 星岩 (敏捷)
Array(3063020, 500, 1, 3), // [A] 星岩 (智力)
Array(3063021, 500, 1, 3), // [A] 星岩 (智力)
Array(3063030, 500, 1, 3), // [A] 星岩 (幸运)
Array(3063031, 500, 1, 3), // [A] 星岩 (幸运)
Array(3063040, 500, 1, 3), // [A] 星岩 (HP上限)
Array(3063041, 500, 1, 3), // [A] 星岩 (HP上限)
Array(3063042, 500, 1, 3), // [A] 星岩 (HP上限)
Array(3063050, 500, 1, 3), // [A] 星岩 (MP上限)
Array(3063051, 500, 1, 3), // [A] 星岩 (MP上限)
Array(3063052, 500, 1, 3), // [A] 星岩 (MP上限)
Array(3063060, 500, 1, 3), // [A] 星岩 (命中值)
Array(3063061, 500, 1, 3), // [A] 星岩 (命中值)
Array(3063062, 500, 1, 3), // [A] 星岩 (命中值)
Array(3063063, 500, 1, 3), // [A] 星岩 (命中值)
Array(3063070, 500, 1, 3), // [A] 星岩 (回避值)
Array(3063071, 500, 1, 3), // [A] 星岩 (回避值)
Array(3063072, 500, 1, 3), // [A] 星岩 (回避值)
Array(3063073, 500, 1, 3), // [A] 星岩 (回避值)
Array(3063080, 500, 1, 3), // [A] 星岩 (速度)
Array(3063081, 500, 1, 3), // [A] 星岩 (速度)
Array(3063090, 500, 1, 3), // [A] 星岩 (跳跃)
Array(3063091, 500, 1, 3), // [A] 星岩 (跳跃)
Array(3063100, 500, 1, 3), // [A] 星岩 (攻击力)
Array(3063101, 500, 1, 3), // [A] 星岩 (攻击力)
Array(3063110, 500, 1, 3), // [A] 星岩 (魔法力)
Array(3063111, 500, 1, 3), // [A] 星岩 (魔法力)
Array(3063120, 500, 1, 3), // [A] 星岩 (物理防御)
Array(3063121, 500, 1, 3), // [A] 星岩 (物理防御)
Array(3063122, 500, 1, 3), // [A] 星岩 (物理防御)
Array(3063130, 500, 1, 3), // [A] 星岩 (魔法防御)
Array(3063131, 500, 1, 3), // [A] 星岩 (魔法防御)
Array(3063132, 500, 1, 3), // [A] 星岩 (魔法防御)
Array(3063140, 500, 1, 3), // [A] 星岩 (力量 %)
Array(3063141, 500, 1, 3), // [A] 星岩 (力量 %)
Array(3063150, 500, 1, 3), // [A] 星岩 (敏捷 %)
Array(3063151, 500, 1, 3), // [A] 星岩 (敏捷 %)
Array(3063160, 500, 1, 3), // [A] 星岩 (智力 %)
Array(3063161, 500, 1, 3), // [A] 星岩 (智力 %)
Array(3063170, 500, 1, 3), // [A] 星岩 (幸运 %)
Array(3063171, 500, 1, 3), // [A] 星岩 (幸运 %)
Array(3063180, 500, 1, 3), // [A] 星岩 (HP上限 %)
Array(3063181, 500, 1, 3), // [A] 星岩 (HP上限 %)
Array(3063190, 500, 1, 3), // [A] 星岩 (MP上限 %)
Array(3063191, 500, 1, 3), // [A] 星岩 (MP上限 %)
Array(3063200, 500, 1, 3), // [A] 星岩 (命中值 %)
Array(3063201, 500, 1, 3), // [A] 星岩 (命中值 %)
Array(3063210, 500, 1, 3), // [A] 星岩 (回避值 %)
Array(3063211, 500, 1, 3), // [A] 星岩 (回避值 %)
Array(3063220, 500, 1, 3), // [A] 星岩 (攻击力 %)
Array(3063221, 500, 1, 3), // [A] 星岩 (攻击力 %)
Array(3063230, 500, 1, 3), // [A] 星岩 (魔法力 %)
Array(3063231, 500, 1, 3), // [A] 星岩 (魔法力 %)
Array(3063240, 500, 1, 3), // [A] 星岩 (物理防御 %)
Array(3063241, 500, 1, 3), // [A] 星岩 (物理防御 %)
Array(3063250, 500, 1, 3), // [A] 星岩 (魔法防御 %)
Array(3063251, 500, 1, 3), // [A] 星岩 (魔法防御 %)
Array(3063260, 500, 1, 3), // [A] 星岩 (爆击率 %)
Array(3063261, 500, 1, 3), // [A] 星岩 (爆击率 %)
Array(3063270, 500, 1, 3), // [A] 星岩 (所有伤害 %)
Array(3063271, 500, 1, 3), // [A] 星岩 (所有伤害 %)
Array(3063280, 500, 1, 3), // [A] 星岩 (全属性 %)
Array(3063281, 500, 1, 3), // [A] 星岩 (全属性 %)
Array(3063290, 500, 1, 3), // [A] 星岩 (全技能等级)
Array(3063300, 500, 1, 3), // [A] 星岩 (无视防御)
Array(3063310, 500, 1, 3), // [A] 星岩 (伤害防御 %)
Array(3063320, 500, 1, 3), // [A] 星岩 (无敌)
Array(3063330, 500, 1, 3), // [A] 星岩 (无敌)
Array(3063340, 500, 1, 3), // [A] 星岩 (恢复率)
Array(3063341, 500, 1, 3), // [A] 星岩 (恢复率)
Array(3063350, 500, 1, 3), // [A] 星岩 (BOSS伤害)
Array(3063351, 500, 1, 3), // [A] 星岩 (BOSS伤害)
Array(3063360, 500, 1, 3), // [A] 星岩 (自动获取)
Array(3063361, 500, 1, 3), // [A] 星岩 (自动获取)
Array(3063370, 500, 1, 3), // [A] 星岩 (技能)
Array(3063380, 500, 1, 3), // [A] 星岩 (技能)
Array(3063390, 500, 1, 3), // [A] 星岩 (技能)
Array(3063400, 500, 1, 3), // [A] 星岩 (技能)
Array(3064002, 500, 1, 3), // [S] 星岩 (力量)
Array(3064012, 500, 1, 3), // [S] 星岩 (敏捷)
Array(3064022, 500, 1, 3), // [S] 星岩 (智力)
Array(3064032, 500, 1, 3), // [S] 星岩 (幸运)
Array(3064042, 500, 1, 3), // [S] 星岩 (HP上限)
Array(3064052, 500, 1, 3), // [S] 星岩 (MP上限)
Array(3064062, 500, 1, 3), // [S] 星岩 (命中值)
Array(3064072, 500, 1, 3), // [S] 星岩 (回避值)
Array(3064081, 500, 1, 3), // [S] 星岩 (速度)
Array(3064091, 500, 1, 3), // [S] 星岩 (跳跃)
Array(3064101, 500, 1, 3), // [S] 星岩 (攻击力)
Array(3064111, 500, 1, 3), // [S] 星岩 (魔法力)
Array(3064124, 500, 1, 3), // [S] 星岩 (物理防御)
Array(3064134, 500, 1, 3), // [S] 星岩 (魔法防御)
Array(3064140, 500, 1, 3), // [S] 星岩 (力量 %)
Array(3064141, 500, 1, 3), // [S] 星岩 (力量 %)
Array(3064150, 500, 1, 3), // [S] 星岩 (敏捷 %)
Array(3064151, 500, 1, 3), // [S] 星岩 (敏捷 %)
Array(3064160, 500, 1, 3), // [S] 星岩 (智力 %)
Array(3064161, 500, 1, 3), // [S] 星岩 (智力 %)
Array(3064170, 500, 1, 3), // [S] 星岩 (幸运 %)
Array(3064171, 500, 1, 3), // [S] 星岩 (幸运 %)
Array(3064180, 500, 1, 3), // [S] 星岩 (HP上限 %)
Array(3064181, 500, 1, 3), // [S] 星岩 (HP上限 %)
Array(3064190, 500, 1, 3), // [S] 星岩 (MP上限 %)
Array(3064191, 500, 1, 3), // [S] 星岩 (MP上限 %)
Array(3064200, 500, 1, 3), // [S] 星岩 (命中值 %)
Array(3064201, 500, 1, 3), // [S] 星岩 (命中值 %)
Array(3064210, 500, 1, 3), // [S] 星岩 (回避值 %)
Array(3064211, 500, 1, 3), // [S] 星岩 (回避值 %)
Array(3064220, 500, 1, 3), // [S] 星岩 (攻击力 %)
Array(3064221, 500, 1, 3), // [S] 星岩 (攻击力 %)
Array(3064230, 500, 1, 3), // [S] 星岩 (魔法力 %)
Array(3064231, 500, 1, 3), // [S] 星岩 (魔法力 %)
Array(3064240, 500, 1, 3), // [S] 星岩 (物理防御 %)
Array(3064241, 500, 1, 3), // [S] 星岩 (物理防御 %)
Array(3064250, 500, 1, 3), // [S] 星岩 (魔法防御 %)
Array(3064251, 500, 1, 3), // [S] 星岩 (魔法防御 %)
Array(3064260, 500, 1, 3), // [S] 星岩 (爆击率 %)
Array(3064261, 500, 1, 3), // [S] 星岩 (爆击率 %)
Array(3064270, 500, 1, 3), // [S] 星岩 (最小爆击伤害 %)
Array(3064271, 500, 1, 3), // [S] 星岩 (最小爆击伤害 %)
Array(3064272, 500, 1, 3), // [S] 星岩 (最小爆击伤害 %)
Array(3064280, 500, 1, 3), // [S] 星岩 (最大爆击伤害 %)
Array(3064281, 500, 1, 3), // [S] 星岩 (最大爆击伤害 %)
Array(3064282, 500, 1, 3), // [S] 星岩 (最大爆击伤害 %)
Array(3064290, 500, 1, 3), // [S] 星岩 (所有伤害 %)
Array(3064291, 500, 1, 3), // [S] 星岩 (所有伤害 %)
Array(3064300, 500, 1, 3), // [S] 星岩 (全属性)
Array(3064301, 500, 1, 3), // [S] 星岩 (全属性)
Array(3064302, 500, 1, 3), // [S] 星岩 (全属性)
Array(3064310, 500, 1, 3), // [S] 星岩 (全属性 %)
Array(3064311, 500, 1, 3), // [S] 星岩 (全属性 %)
Array(3064320, 500, 1, 3), // [S] 星岩 (全技能等级)
Array(3064330, 500, 1, 3), // [S] 星岩 (属性抗性)
Array(3064340, 500, 1, 3), // [S] 星岩 (异常状态抗性)
Array(3064341, 500, 1, 3), // [S] 星岩 (异常状态抗性)
Array(3064350, 500, 1, 3), // [S] 星岩 (无视防御)
Array(3064360, 500, 1, 3), // [S] 星岩 (伤害防御 %)
Array(3064370, 500, 1, 3), // [S] 星岩 (无敌)
Array(3064380, 500, 1, 3), // [S] 星岩 (无敌)
Array(3064390, 500, 1, 3), // [S] 星岩 (伤害反弹)
Array(3064391, 500, 1, 3), // [S] 星岩 (伤害反弹)
Array(3064392, 500, 1, 3), // [S] 星岩 (伤害反弹)
Array(3064393, 500, 1, 3), // [S] 星岩 (伤害反弹)
Array(3064400, 500, 1, 3), // [S] 星岩 (MP消耗减少)
Array(3064401, 500, 1, 3), // [S] 星岩 (MP消耗减少)
Array(3064410, 500, 1, 3), // [S] 星岩 (恢复率)
Array(3064420, 500, 1, 3), // [S] 星岩 (冷却时间减少)
Array(3064421, 500, 1, 3), // [S] 星岩 (冷却时间减少)
Array(3064430, 500, 1, 3), // [S] 星岩 (BOSS伤害)
Array(3064431, 500, 1, 3), // [S] 星岩 (BOSS伤害)
Array(3064440, 500, 1, 3), // [S] 星岩 (金币掉率)
Array(3064441, 500, 1, 3), // [S] 星岩 (金币掉率)
Array(3064442, 500, 1, 3), // [S] 星岩 (金币掉率)
Array(3064450, 500, 1, 3), // [S] 星岩 (道具掉率)
Array(3064451, 500, 1, 3), // [S] 星岩 (道具掉率)
Array(3064452, 500, 1, 3), // [S] 星岩 (道具掉率)
Array(3064460, 500, 1, 3), // [S] 星岩 (自动获取)
Array(3064461, 500, 1, 3), // [S] 星岩 (自动获取)
Array(3064470, 500, 1, 3), // [S] 星岩 (技能)
Array(3064480, 500, 1, 3), // [S] 星岩 (技能)
Array(3064490, 500, 1, 3)  //[S] 星岩 (技能)

);
} else if(random == 6){
itemList = Array(
// ------ 装备 ------
Array(1012319, 500, 1, 3), //8周年点点红
Array(4310030, 500, 1, 3), //运动会币
Array(1112915, 500, 1, 3), //蓝调戒指
Array(1202023, 500, 1, 3), //真·乔图腾
Array(1202027, 500, 1, 3), //真·海丽蜜图腾
Array(1202031, 500, 1, 3), //真·小龙图腾
Array(1202035, 500, 1, 3), //真·李卡司图腾
Array(1112586, 500, 1, 3), //黑天使的祝福
Array(1112663, 500, 1, 3), //白天使的祝福
Array(1113084, 500, 1, 3) //黑龙传说指环
);
} else if(random == 7){
itemList = Array(
// ------ 特殊 ------
Array(5064300, 500, 1, 3), //卷轴防护卷轴
Array(4310030, 500, 1, 3), //运动会币
Array(5062500, 500, 1, 3), //大师附加神奇魔方
Array(5062000, 500, 1, 3), //神奇魔方
Array(5064000, 500, 1, 3), //防爆卷轴
Array(5064100, 500, 1, 3), //保护卷轴
Array(5062002, 500, 1, 3), //高级神奇魔方
Array(3994701, 500, 1, 3), //冒险岛转蛋券
Array(2614006, 500, 1, 3), //突破一万之石 30%
Array(2614009, 500, 1, 3), //突破一万之石 30%
Array(2614012, 500, 1, 3), //突破一万之石 50%
Array(2614015, 500, 1, 3)  //突破一万之石 50%
);
}

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            im.sendOk("不想使用吗？…我的肚子里有各类#b奇特座椅或卷轴、装备、新奇道具#k哦！");
            im.dispose();
        }
        status--;
    }
    if (status == 0) {
        var chance = Math.floor(Math.random() * 1100);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = im.gainGachaponItem(itemId, quantity, "每日礼物箱", notice);
            if (item != -1) {
		im.gainItem(2430781, -1);
                im.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                im.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            im.safeDispose();
        } else {
	    im.gainItem(2430781, -1);
            im.sendOk("今天的运气可真差，什么都没有拿到。");
            im.safeDispose();
        }
    }
}