/* Natalie
	Henesys VIP Hair/Hair Color Change.
*/
var status = -1;
var beauty = 0;
var hair_Colo_new;

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 0) {
        cm.dispose();
        return;
    } else {
        status++;
    }
    if (status == 0) {
        cm.sendSimple("我是美发店老板娜塔丽。只要你有万能高级美发卡，就把头发交给我吧。选择你想做的事情吧。\r\n#b#L0#更换发型(使用高级会员卡)#l\r\n#L1#染色(使用高级会员卡)#l");
    } else if (status == 1) {
        if (selection == 0) {
            var hair = cm.getPlayerStat("HAIR");
            hair_Colo_new = [];
            beauty = 1;
            if (cm.getPlayerStat("GENDER") == 0) {
                hair_Colo_new = [30030, 30020, 30000, 30310, 30330, 30060, 30150, 30410, 30210, 30140, 30120, 30200, 36440,36450,36490,36510,36520,36580,36590,36600,36620,36630,36640,36650,36670,36680,36690,36700,36710,36720,36730,36750,36810,36820,36830,36840,36850,36860,36880,36890,36910,36920,36930,36940,36950,36990,33260,33270,33280,33290,33300,33310,33320,33330,33340,33360,33370,33380,33390,33400,33410,33430,33440,33460,33470,33480,33500,33520,33540,33550,33580,33600,33630,33640,33660,33810,33930,33940,33950,33960,35180,35200,35210,35220,35230,35240,35250,35260,35270,35280,35290,35300,35330,35340,35350,35360,35420,35430,35440,35450,35460,35470,35490,35510,35520,35560,35600,35620,35630,35650,35660,35680,35690,35700,35720,35730,35750,35760,35770,35790,35800,35950,35960,36070,36080,36130,36140,36160,36180,36260,36280,36310,36330,36340,36350,36360,36380,36390,36410,36421];
            } else {
                hair_Colo_new = [31050, 31040, 31000, 31150, 31310, 31300, 31160, 31100, 31410, 31030, 31080, 31070, 31340,31360,31530,31560,31590,31670,31680,31840,31930,31990,32130,32140,32150,32160,32510,33680,33790,33950,34100,34110,34120,34130,34160,34180,34210,34220,34230,34240,34250,34260,34270,34280,34310,34320,34330,34340,34350,34360,34370,34380,34450,34470,34480,34490,34510,34540,34560,34590,34610,34620,34630,34640,34660,34670,34680,34690,34700,34710,34720,34730,34750,34760,34770,34780,34790,34800,34810,34830,34840,34850,34860,34870,34880,34890,34900,34910,34940,34950,34960,34970,34980,35080,35190,35210,35490,35500,35540,35640,36340,36400,36940,37000,37010,37030,37041,37050,37060,37070,37080,37090,37100,37110,37180,37190,37200,37210,37220,37230,37270,37280,37290,37300,37310,37320,37330,37340,37350,37370,37380,37400,37420,37410,37430,37440,37450,37460,37500];
            }
            for (var i = 0; i < hair_Colo_new.length; i++) {
                hair_Colo_new[i] = hair_Colo_new[i] + (hair % 10);
            }
            cm.askAvatar("我可以帮你换成全新的发型。你厌倦了现在的发型了吗？只要你有#b万能会员卡#k，我就可以帮你更换发型。请慢慢挑选自己喜欢的发型～", 5150001, hair_Colo_new);
        } else if (selection == 1) {
            var currenthaircolo = Math.floor((cm.getPlayerStat("HAIR") / 10)) * 10;
            hair_Colo_new = [];
            beauty = 2;
            for (var i = 0; i < 8; i++) {
                hair_Colo_new[i] = currenthaircolo + i;
            }
            cm.askAvatar("我们可以为你改变头发的颜色。是不是已经厌倦了头发的颜色啊？如果你有#b万能会员卡#k，我就可以给你染发，慢慢挑选你喜欢的颜色吧！", 5151001, hair_Colo_new);
        }
    } else if (status == 2) {
        if (beauty == 1) {
            if (cm.setAvatar(5150001 , hair_Colo_new[selection]) == 1) {
                cm.sendOk("理发好了，怎么样？看看你的新发型吧！");
            } else {
                cm.sendOk("嗯……你好像没有美发店专用会员卡啊？不好意思，没有会员卡的话，我就不能帮你理发。");
            }
        } else {
            if (cm.setAvatar(5151001, hair_Colo_new[selection]) == 1) {
                cm.sendOk("好了，让朋友们赞叹你的新发色吧！");
            } else {
                cm.sendOk("嗯… 看来你没有我们美发店的会嘛！不好意思，如果没有会员卡，我们不可以给你染头发。");
            }
        }
        cm.dispose();
    }
}