var status = 0;
var item = 
Array(
			Array(2040001,800,1), //Í·¿ø·ÀÓù¾íÖá60
			Array(2040002,800,1), //10
			Array(2040008,800,1), //°¡»ùÀïË¹70
			Array(2040009,800,1), //°¡»ù50
			Array(2040010,800,1), //Í»½ø70
			Array(2040011,600,1), //Í»½ø50
			Array(2040012,600,1), //Ì©É½70
			Array(2040013,600,1), //Ì©É½50
			Array(2040014,700,1), //½ø¶·Æø70
			Array(2040015,800,1), //½ø¶·Æø50 
			Array(2040016,800,1), //ÇáÎè70
			Array(2040017,800,1), //ÇáÎè50
			Array(2040018,800,1), //Á¬»·ÆÆ70
			Array(2040019,800,1), //Á¬»·ÆÆ50
			Array(2040100,800,1), //º®±ù70
			
			Array(2040101,800,1), //º®±ù50
			Array(2040102,800,1), //¿û»¨70
			Array(2040103,800,1), //¿û»¨50
			Array(2040104,800,1), //Ê¥Òõ½£70
			Array(2040105,800,1), //Ê¥´¸×Ó70
			Array(2040106,800,1), //Ê¥Óò70
			Array(2040108,800,1), //Ê¥Óò50


                        Array(2040109,800,1), //¶ñÁú70
			Array(2040200,800,1), //¶ñÁú50
			Array(2040201,800,1), //·¨·´70
			Array(2040203,800,1), //·¨·´50
			Array(2040206,800,1), //´´70
			Array(2040301,800,1), //´´50
			Array(2040302,800,1), //ÖÕ¼«70
			Array(2040303,600,1), //ÖĞ¼¶50
			Array(2040305,600,1), //Á¬»·ÆÆ70
			Array(2040306,800,1), //50
			Array(2040308,800,1), //Á¬»·ÉÁ70
			Array(2040310,800,1), //50
			Array(2040402,800,1), //Ê¥¶Ü70
			Array(2040404,800,1), //50
			Array(2044024,800,1), //»ğÇò70
			Array(2044014,800,1), //50
			Array(2041308,800,1), //±ùÊŞ70
			Array(2041311,800,1), //50
			Array(2041310,800,1), //ÂäĞÇ70
			Array(2041306,800,1), //50
			Array(2041307,800,1), //±ùÇò70
			Array(2041304,800,1), //±ùÇò50
			Array(2041305,800,1), //»ğÊŞ70
			Array(2041302,800,1), //50
			Array(2041303,800,1), //±ùÆÆ70
			Array(2041300,800,1), //50
			Array(2041301,600,1), //Ê¥¹â70
			Array(2044102,600,1), //50
			Array(2044101,800,1), // ¹âÃ¢·É½¦70
			Array(2041022,800,1), //50
			Array(2041023,500,1), //»ğÑÛ70
			Array(2041020,500,1), //50
			Array(2041016,900,1), //·ÉÁú70
			Array(2041017,900,1), //50
			Array(2041014,800,1), //Éñ¼â70
			Array(2041019,800,1), //50
			Array(2041013,800,1), //»÷ÍË70
			Array(2041010,800,1), //50
			Array(2041011,600,1), //±©·çÓê70
			Array(2041004,300,1), //±©·çÓê50
			Array(2041005,800,1), //»ğ·ï»Ë70
			Array(2041007,800,1), //50
			Array(2041008,800,1), //¼¯ÖĞ70
			Array(2041001,800,1), //50
			Array(2041002,500,1), //ÉñÅ¬ÊÖ70
			Array(2044301,800,1), //50
			Array(2044302,800,1), //´ÌÑÛ70
			Array(2041202,800,1), //50
			Array(2041201,800,1), //´©Í¸70
			Array(2041207,800,1), //50
			Array(2041206,800,1), //±ùÓ¥70
			Array(2044201,800,1), //50
			Array(2044202,800,1), //Ò»¼º70
			Array(2044212,800,1), //50
			Array(2044214,800,1), //¼Ù¶¯×÷70
			Array(2043001,800,1), //50
			Array(2043002,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043009,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043017,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2048001,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040933,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040931,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040928,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040927,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040925,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040924,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040920,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040915,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040914,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040902,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040901,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043002,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043009,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043017,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2048001,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040933,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040801,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040816,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040805,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040802,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040824,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040825,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2046012,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044909,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040513,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040514,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040516,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040517,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040534,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040532,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2049100,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040501,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040502,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040504,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2049143,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044902,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044901,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040413,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040412,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044807,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044809,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040418,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043009,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040425,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040427,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040421,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040422,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044802,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044803,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044801,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040401,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040402,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043311,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2046223,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043302,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040705,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040708,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040701,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043212,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043201,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040612,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040622,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040625,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040601,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040602,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043101,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043102,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044511,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043811,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043801,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043802,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30 11
			Array(2044501,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044502,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2046534,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044412,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044402,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044401,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040017,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040029,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040004,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040005,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040002,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040001,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043702,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043701,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043711,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2047967,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044711,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040301,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040302,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044702,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044701,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040317,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040311,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040310,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040318,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040323,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044611,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044602,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044601,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040206,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040205,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040201,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040200,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2046891,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044003,100,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044103,100,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044303,100,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044203,400,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043003,200,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040903,200,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040806,100,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040507,200,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040506,100,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044908,200,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044815,400,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040403,200,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043303,100,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040710,600,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040711,600,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043203,500,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040603,300,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043103,400,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043803,200,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044503,100,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044403,100,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040006,100,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040007,200,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2043703,200,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2040303,100,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044703,100,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2044603,200,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2340000,800,1), //È­Ì×¹¥»÷×çÖä¾íÖá30
			Array(2022140,500,1) //È­Ì×¹¥»÷×çÖä¾íÖá(±Ø³É)
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (mode == 0) {
			cm.dispose();
			return;
		}
		if (mode == 1)
			status++;
		else
			status--;
		if (status == 0) {
			if (cm.getNX() >= 345) {
				cm.sendYesNo("»¶Ó­²Î¼Ó±¾´ÎÏµÍ³»î¶¯¡£Ê¹ÓÃµã¾íÄã¿É»ñµÃÒìÏë²»µ½µÄ¾íÖá£¡ÏµÍ³»áËæ»ú³éÈ¡ÎïÆ·,ÊÇ·ñ¼ÌĞøÊ¹ÓÃ345µã¾í½øĞĞ³é½±£¿");
			} else {
				cm.sendOk("»¶Ó­²Î¼Ó±¾´ÎÏµÍ³»î¶¯¡£ÄãÈ·¶¨ÓĞ345µã¾íÂğ£¿");
				cm.dispose();
			}
		} else if (status == 1){	
			var ii = net.sf.odinms.server.MapleItemInformationProvider.getInstance();
			for(var i = 1;i<=5;i++){
				if(cm.getPlayer().getInventory(net.sf.odinms.client.MapleInventoryType.getByType(i)).isFull()){
					cm.sendOk("ÄúÖÁÉÙÓ¦¸ÃÈÃËùÓĞ°ü¹ü¶¼¿Õ³öÒ»¸ñ");
					cm.dispose();
					return;
				}
			}
			var chance = Math.floor(Math.random()*1000);
			var finalitem = Array();
			for(var i = 0 ;i<item.length;i++){
				if(item[i][1] >= chance){
					finalitem.push(item[i]);
				}
			}
			if(finalitem.length != 0){
				var random = new java.util.Random();
				var finalchance = random.nextInt(finalitem.length);
				var itemId = finalitem[finalchance][0];
				var quantity = finalitem[finalchance][2];
			        if(ii.getInventoryType(itemId).getType() == 1){
			        	var toDrop = ii.randomizeStats(ii.getEquipById(itemId)).copy();
				}
				else{
				 	 var toDrop = new net.sf.odinms.client.Equip(itemId,0).copy();
				}
				net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop,-1);
				cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.getItemMega(cm.getC().getChannel(),cm.getPlayer().getName() + " : " + "´Ó¾íÖá³é½±»ú»ñµÃ£¡´ó¼ÒÒ»Æğ¹§Ï²Ëû£¨Ëı£©°É£¡£¡£¡",toDrop, true).getBytes());				
				cm.gainNX(-345);
				cm.getPlayer().saveToDB(true);
				cm.sendOk("·Ç³£¸ĞĞ»²Î¼Ó±¾´ÎÏµÍ³»î¶¯¡£¶à¶àÅ¬Á¦¡£»ñÈ¡¸ü¶àµÄÀñÎï°É£¡");
				cm.dispose();
			} else {							
				cm.gainNX(-345);
				cm.gainItem(2022140,1);
				cm.getPlayer().saveToDB(true);
				cm.sendOk("»¶Ó­²Î¼Ó±¾´ÎÏµÍ³»î¶¯¡£ÄãÊ²Ã´Ò²Ã»³éµ½¡£¸øÄãÒ»µã°²Î¿½±£¡");
				cm.dispose();
			}
		}
	}
}
