status = -1;
var itemList = Array(

			
		
			Array(2043003,500, 1, 1), //单手剑攻击卷轴(必成)
			Array(2044003,500, 1, 1), //双手剑攻击卷轴(必成)
			Array(2044303,500, 1, 1), //枪攻击攻击卷轴(必成)
			Array(2044403,500, 1, 1), //矛攻击攻击卷轴(必成)
			Array(2044503,500, 1, 1), //弓攻击攻击卷轴(必成)
			Array(1382037,100,1), //偃月之杖
			Array(2044603,500, 1, 1), //弩攻击必成卷
			Array(2043703,500, 1, 1), //短杖攻击必成卷
			Array(2043803,500, 1, 1), //长杖攻击诅轴(必成)
			Array(2043303,500, 1, 1), //短剑攻击必成卷
			Array(2044703,500, 1, 1), //拳套攻击诅轴(必成)
			Array(2044908,500, 1, 1), //短枪攻击卷轴(必成)
			Array(2044815,500, 1, 1), //指节攻击必成卷
			Array(2040807,500, 1, 1), //手套攻击卷轴(必成)
			Array(2040506,500, 1, 1), //全身铠甲敏捷卷轴(必成)
			Array(2040710,500, 1, 1), //鞋子跳跃卷轴(必成)
            Array(5520000, 200, 1, 1),//剪刀
            Array(5570000, 200, 1, 1),//金锤子%
			//披风------
			Array(1102382,500, 1, 1), //极真
			Array(1102383,500, 1, 1), //极真
		    Array(1102041,500, 1, 1), //粉浪 
		    Array(1102042,500, 1, 1), //紫浪 
		    Array(1102163,500, 1, 1), //贵族披风
		    Array(1102207,500, 1, 1), //金魂
		    Array(1102206,500, 1, 1),//黑色野兽
//-------耳环-------
			
			

			
		Array(1082149,200, 1, 1), //工地手套(褐)
		   Array(1122000,500, 1, 1), //黑龙链
		Array(1003720,30, 1, 1),//进阶半半头盔
		Array(1003721,30, 1, 1),//进阶女王王冠
		//鞋子
		Array(1072664 ,500, 1, 1),//外星人之靴
		Array(1072799  ,500, 1, 1),//妖精争执靴
		//脸  
		Array(1012259   ,500, 1, 1),//高级封锁灰色徽章 - (无描述)3不能升级不可交易
		Array(1012252   ,500, 1, 1),//闪亮红色特殊徽章 - (无描述)5G不能升级		可交易
		Array(1012411   ,500, 1, 1),//白色专属匠人徽章 - (无描述)5G可升级+1  5G可交易
		Array(1012474   ,200, 1, 1),//10周年大赏枫叶脸饰 - (无描述)10G不可交易   可升级3次 
		Array(1012171   ,50, 1, 1),//恐怖鬼娃20G
		
		//眼镜 
		Array(1022117  ,500, 1, 1),//玛瑙龙眼镜3G   不可砸
		Array(1022185  ,500, 1, 1),//瑞贝卡的古典眼镜 - (无描述)3G可交易7次
		Array(1022224  ,500, 1, 1),//独眼巨人之眼Lv.1
		Array(1022225  ,500, 1, 1),//独眼巨人之眼Lv.2
		Array(1022226  ,150, 1, 1),//独眼巨人之眼Lv.3
		
		//套服
		
		Array(1052758      ,200, 1, 1),//11周年衣服
		Array(1052569      ,500, 1, 1),//革命战斗服
		Array(1052460      ,500, 1, 1),//外星人
		Array(1052467      ,500, 1, 1),//高级
		
		//戒指1112597 - 希纳斯的钻石戒指
		
		//Array(1113074      ,200, 1, 1),//低级
		Array(1113075      ,200, 1, 1),//最高级贝勒戒指
		Array(1112597     ,200, 1, 1),//希纳斯的钻石戒指
		Array(1113040      ,500, 1, 1),//瑞贝卡的枫叶戒指
		Array(1113017      ,50, 1, 1),//妖精争执戒指
		Array(1112951      ,100, 1, 1),//麦格纳斯的愤怒
		Array(1112952      ,80, 1, 1),//希拉的愤怒
		Array(1112804     ,500, 1, 1),//结婚戒指
		Array(1112738     ,500, 1, 1),//外星人之戒指
		//耳环
		Array(1032232    ,180, 1, 1),//海光耳环 - (无描述)
		//腰带
		Array(1132228    ,200, 1, 1),//10周年黑色腰带 - (无描述)
		//可抽可合
		
		Array(1032174     ,500, 1, 1),//瑞贝卡的酸甜耳环 - (无描述)
		Array(1022168     ,500, 1, 1),// 黑羽眼镜 - (无描述)  -攻击1	可升级3  不可交易
		Array(1012348     ,500, 1, 1),//2013圣诞鹿的鼻子 - (无描述)
		Array(1132013     ,500, 1, 1),//1132013 - 不灭的法老腰带 - (无描述)
		
		
		//帽子
		    Array(1402204,100, 1, 1), //巨匠巨剑
		    Array(1002939,500, 1, 1), //安全帽 1003561 
		    Array(1003621,200, 1, 1), //PB  
		    Array(1003722,200, 1, 1), //进阶贝伦头盔  
		    Array(1452214,100, 1, 1), //巨匠战斗弓
		    Array(1332235,100, 1, 1), //巨匠短刀
		    Array(1452060,100, 1, 1), //绯红之弓
		    Array(1442068,100, 1, 1), //绯红弯刀
		    Array(1382060 ,100, 1, 1), //绯红法杖
		    Array(1302285 ,100, 1, 1), //巨匠战剑
		    Array(1432176 ,100, 1, 1), //巨匠枪
		    Array(1492188 ,100, 1, 1), //巨匠短枪
		    Array(1372186 ,100, 1, 1), //巨匠邪恶杖
		    Array(1462202 ,500, 1, 1), //巨匠弩
			
			Array(1004422,50, 1, 1), //埃苏莱布斯法师帽
			Array(1004423,50, 1, 1), //埃苏莱布斯弓箭手帽
			Array(1004424,50, 1, 1), //埃苏莱布斯骑士头盔
			Array(1004425,50, 1, 1), //埃苏莱布斯飞侠帽
			Array(1004426,50, 1, 1), //埃苏莱布斯海盗帽

			Array(1122034,30, 1, 1), //觉醒的冒险之心         
			Array(1122035,30, 1, 1), //觉醒的冒险之心
			Array(1122036,30, 1, 1), //觉醒的冒险之心
			Array(1122037,30, 1, 1), //觉醒的冒险之心
			Array(1122038,30, 1, 1), //觉醒的冒险之心
			Array(1052882,30, 1, 1), //埃苏莱布斯骑士套装
			Array(1052888,30, 1, 1), //埃苏莱布斯弓箭手套装
			Array(1052889,30, 1, 1), //埃苏莱布斯飞侠套装
			Array(1052887,30, 1, 1), //埃苏莱布斯魔法师套装
			Array(1052890,30, 1, 1), //埃苏莱布斯海盗套装
			Array(1052167,200,1), //最强工作套
			Array(1113039,100,1), //妖精女皇戒指
			Array(1113089,100,1), //伊帕娅之戒指 
			
		Array(1032208      ,80, 1, 1),//神话耳环复原第3阶段 - (无描述)
		Array(1032209     ,80, 1, 1),//神话耳环复原第4阶段 - (无描述)
		Array(1032219      ,33, 1, 1),//遗忘之神话耳环 - (无描述)
			
			
		    Array(1102481 ,10, 1, 1),//暴君披风
		    Array(1102482 ,10, 1, 1),//暴君披风
		    Array(1102483 ,10, 1, 1),//暴君披风
		    Array(1102484 ,10, 1, 1),//暴君披风
		    Array(1102485 ,10, 1, 1),//暴君披风
		    Array(1082544 ,10, 1, 1),//暴君赫尔梅斯手套
		    Array(1082545 ,10, 1, 1),//暴君凯伦手套
		    Array(1082546 ,10, 1, 1),//暴君利卡昂手套
		    Array(1082547 ,10, 1, 1),//暴君阿尔泰手套
		    Array(1082543 ,10, 1, 1),//暴君西亚戴斯手套
			
		    Array(1072743  ,10, 1, 1),//暴君鞋
		    Array(1072744  ,10, 1, 1),//暴君鞋
		    Array(1072745  ,10, 1, 1),//暴君鞋
		    Array(1072746  ,10, 1, 1),//暴君鞋
		    Array(1072747  ,10, 1, 1),//暴君鞋
			
		    Array(1132174   ,10, 1, 1),//暴君腰带
		    Array(1132175   ,10, 1, 1),//暴君腰带
		    Array(1132176   ,10, 1, 1),//暴君腰带
		    Array(1132177   ,10, 1, 1),//暴君腰带
		    Array(1132178   ,10, 1, 1),//暴君腰带
		    Array(1132243,500,1), //低级贝勒德刻印腰带
			Array(1132244,300,1), //中级贝勒德刻印腰带
			Array(1132245,200,1), //高级贝勒德刻印腰带
			Array(1132246,50,1), //最高级贝勒德刻印腰带
			Array(1132211,100,1), //冒险岛强韧意志黄色腰带
			Array(1132212,500,1), //冒险岛强韧意志绿色腰带
			Array(1132213,300,1), //冒险岛强韧意志蓝色腰带
			Array(1132214,50,1), //冒险岛强韧意志红色腰带
			Array(1132215,30,1), //冒险岛强韧意志黑色腰带
			//-------帽子-------
			Array(1382050,50, 1, 1), //玄武长杖
			Array(1382052,50, 1, 1), //青龙长杖
			//-------武器------

			Array(1302152,250, 1, 1), //狮心弯刀
			Array(1402095,250, 1, 1), //狮心战斗弯刀
			Array(1432088,250, 1, 1), //纯白之爱天使之光
			Array(1442116,250, 1, 1), //狮心矛
			Array(1382104,250, 1, 1), //龙尾战斗长杖
			Array(1452111,250, 1, 1), //鹰翼组合弓
			Array(1462099,250, 1, 1), //鹰翼重弩
			Array(1332130,250, 1, 1), //渡鸦之魂短刀
			Array(1472122,250, 1, 1), //渡鸦之魂钢铁拳套
			Array(1482086,250, 1, 1), //纯白之爱天使之光
			Array(1492085,250, 1, 1), //鲨齿锐利手铳

			Array(1302275,10, 1, 1), //法弗纳银槲之剑
			Array(1402196,10, 1, 1), //法弗纳忏悔之剑
			Array(1432167,10, 1, 1), //法弗纳贯雷枪
			Array(1442223,10, 1, 1), //法弗纳半月宽刃斧
			Array(1382208,10, 1, 1), //法弗纳魔冠之杖
			Array(1452205,10, 1, 1), //法弗纳追风者
			Array(1462193,10, 1, 1), //法弗纳双风翼弩
			Array(1332225,10, 1, 1), //法弗纳大马士革剑
			Array(1472214,10, 1, 1), //法弗纳危险之手
			Array(1482168,10, 1, 1), //法弗纳巨狼之爪
			Array(1492179,10, 1, 1), //法弗纳左轮枪
			Array(1402214,10, 1, 1), //红色双手剑
			Array(1432182,10, 1, 1), //红色枪
			Array(1382226,10, 1, 1), //红色长杖  
			Array(1452220,10, 1, 1), //红色弓                           
			Array(1462208,10, 1, 1), //红色之弩
			Array(1332242,10, 1, 1), //红色切割者
			Array(1472230,10, 1, 1), //红色拳套 
			Array(1482183,10, 1, 1), //红色拳甲  
			Array(1492194,10, 1, 1), //红色短枪
			Array(1302158,10,1), //【稀】魔剑 		
			
			//Array(1472214,50, 1, 1), //法弗纳
			Array(1402037,200, 1, 1), //龙背刀
			Array(4031217,500, 1, 1),  //黄金钥匙
			Array(1402047,500, 1, 1),//重生玄冥剑
			Array(1432049,500, 1, 1), //重生显圣枪
			Array(1442067,500, 1, 1), //重生神光戟
			Array(1452059,500, 1, 1), //重生惊电弓
			Array(1462051,500, 1, 1), //重生冥雷弩
			Array(1472071,500, 1, 1), //重生大悲赋
			Array(1482024,500, 1, 1), //重生孔雀翎
			Array(1492025,500, 1, 1), //重生凤凰铳
			Array(1302086,500, 1, 1), //重生破甲剑
			Array(1332075,500, 1, 1), //重生狂鲨锯
			Array(1332076,500, 1, 1), //重生断首刃
			Array(1382059,500,1, 1)//重生蝶翼杖
			
			/*
			
        {id:1302086,box:2,max:1,add:1,need_jb:5000000,need_item:[{id:1302059,num:1},{id:4250802,num:5},{id:4005004,num:5}]},
        {id:1402047,box:2,max:1,add:1,need_jb:5000000,need_item:[{id:1402036,num:1},{id:4250802,num:5},{id:4005004,num:5}]},
        {id:1432049,box:2,max:1,add:1,need_jb:5000000,need_item:[{id:1432038,num:1},{id:4250802,num:5},{id:4005004,num:5}]},
        {id:1442067,box:2,max:1,add:1,need_jb:5000000,need_item:[{id:1442045,num:1},{id:4250802,num:5},{id:4005004,num:5}]},
        {id:,box:2,max:1,add:1,need_jb:5000000,need_item:[{id:1382036,num:1},{id:4250902,num:5},{id:4005004,num:5}]},
        {id:1452059,box:2,max:1,add:1,need_jb:5000000,need_item:[{id:1452044,num:1},{id:4251102,num:5},{id:4005004,num:5}]},
        {id:1462051,box:2,max:1,add:1,need_jb:5000000,need_item:[{id:1462039,num:1},{id:4251102,num:5},{id:4005004,num:5}]},
        {id:1332076,box:2,max:1,add:1,need_jb:5000000,need_item:[{id:1332050,num:1},{id:4251002,num:5},{id:4005004,num:5}]},
        {id:1472071,box:2,max:1,add:1,need_jb:5000000,need_item:[{id:1472051,num:1},{id:4251002,num:5},{id:4005004,num:5}]},
        {id:1482024,box:2,max:1,add:1,need_jb:5000000,need_item:[{id:1482013,num:1},{id:4250802,num:5},{id:4005004,num:5}]},
        {id:1492025,box:2,max:1,add:1,need_jb:5000000,need_item:[{id:1492013,num:1},{id:4251102,num:5},{id:4005004,num:5}]}
			*/
			//------药水------			

);

function start() {
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            cm.sendOk("再见得把油。");
            cm.dispose();
        }
        status--;
    }
		if (status == 0) {
			if (cm.getmoneyb() >= 10) {
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendYesNo("消耗#b10#k充值币抽取以下物品!\r\n#k当前充值币:#r" + cm.getmoneyb() + " 以下是全部物品:" + str1);
			} else {
var str1 = "\r\n";	
           for (var i = 0; i < itemList.length; i++){
                   str1 += "#v"+itemList[i][0]+"#";
            }
				cm.sendOk("消费#b10#k充值币抽取以下物品.\r\n#k次当前充值币:#r[ " + cm.getmoneyb() + " ]#k\r\n抽奖所有奖品如下:" + str1);
				cm.dispose();
			}
		} else if (status == 1){	
        var chance = Math.floor(Math.random() * 500);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            var item;
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            var notice = finalitem[finalchance][3];
            item = cm.gainGachaponItem(itemId, quantity, "土豪充值币", notice);
            if (item != -1) {
				cm.setmoneyb(-10);
				if (itemId==1442029){
					cm.gainItem(1442029,-1); //优秀玩家勋章
				    cm.gainItem(1442029,0,0,0,0,0,0,175,0,0,0,0,0,0,0); //优秀玩家勋章
				}
                cm.sendOk("你获得了 #b#t" + item + "##k " + quantity + "个。");
            } else {
                cm.sendOk("请你确认在背包的装备，消耗，其他窗口中是否有一格以上的空间。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。\r\n(获得了安慰奖：白雪人法老的蓝宝石。)");
            cm.setmoneyb(-10);
            cm.gainItem(4001322, 1);
            cm.safeDispose();
        }
    }
}
