function start() {
    status = -1;

    action(1, 0, 0);
}
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    }
    else {
        if (status >= 0 && mode == 0) {

            cm.sendOk("感谢你的光临！");
            cm.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        }
        else {
            status--;
        }
        if (status == 0) {
            var tex2 = "";
            var text = "";
            for (i = 0; i < 10; i++) {
                text += "";
            }
			//显示物品ID图片用的代码是  #v这里写入ID#
            text += "#e#r累积充值达到5000礼包，可获得：#n#b\r\n1、回收精灵吊坠，并且在原有精灵吊坠上面+50G、+50魔攻 \r\n2、外星人手套  （四维55、40攻、40魔攻）\r\n3、外星人之腰带  （四维55、40攻、40魔攻）\r\n4、外星人鞋子  （四维55、40攻、40魔攻）\r\n5、外星人披风（四维55、40攻、40魔攻）\r\n6、本职业150级武器+15 \r\n7、外星人头盔  （四维属性+40 攻击力与魔法力+30） \r\n8、外星人衣服  （四维属性+40 攻击力与魔法力+30）\r\n9、透明耳环（四维属性+20 攻击力*魔法力+20）\r\n10、猫头鹰一个（四维30、20攻、20魔攻）\r\n11、恐怖鬼娃娃伤口180一个\r\n12、祝福*混沌+30\r\n13、勋章一个  （四维+70、攻击/魔攻+70、移动+20、跳跃+20、血/蓝+7000）\r\n14、MXB+5000W\r\n15、皇家理发卷（可随机更换皇家发型）=10张\r\n#r领取礼包必须要有足够的空间哦，否则被系统吞了东西，管理员不负责哦\r\n"//3
            text += "#L1##r#v4310025#领取累计充值5000礼包#l\r\n\r\n"//3
            cm.sendSimple(text);
        } else if (selection == 1) {
                      if(!cm.canHold(1112793,1)){
			cm.sendOk("请清理你的背包，至少空出2个位置！");
            cm.dispose();
        } else if(cm.haveItem(4310025,1)){
				cm.gainItem(4310025, -1);
				cm.gainItem(5150040, 10);//皇家
				cm.gainItem(2049100, 30);//祝福
				cm.gainItem(2340000, 30);//混沌
				cm.gainItem(1012174, 1);//伤口
				cm.gainItem(1082432,55,55,55,55,0,0,40,40,100,100,50,50,0,0);//外星人手套
				cm.gainItem(1132152,55,55,55,55,0,0,40,40,100,100,0,0,0,0);//外星人之腰带
				cm.gainItem(1072664,55,55,55,55,0,0,40,40,30,30,0,0,0,0);//外星人之鞋子
				cm.gainItem(1102163,55,55,55,55,0,0,40,40,100,100,50,50,0,0);//贵族披风
				cm.gainItem(1142142,70,70,70,70,7000,7000,70,70,100,100,100,100,20,20);//xunzhang
				cm.gainItem(1003540,40,40,40,40,100,100,30,30,100,100,50,50,0,0);//外星人头盔
				cm.gainItem(1052460,40,40,40,40,100,100,30,30,100,100,50,50,0,0);//外星人衣服
				cm.gainItem(1032024,20,20,20,20,0,0,20,20,0,0,0,0,0,0);//透明耳环
				cm.gainItem(1022047,30,30,30,30,100,100,20,20,100,100,50,50,0,0);//龙眼镜一个
				cm.gainItem(1122017,0,0,0,0,0,0,50,50,0,0,0,0,0,0);//
				cm.gainMeso(50000000);
            cm.sendOk("领取成功，本职业150级武器+15 必须找管理员获得！");
cm.喇叭(2, "恭喜[" + cm.getPlayer().getName() + "]成功领取累积充值5000礼包！！");
            cm.dispose();
			}else{
            cm.sendOk("你的充值达不到限度，或者你已经领取过了，请勿重复领取！");
            cm.dispose();
			}
		}
    }
}


