//odinms_MS
importPackage(net.sf.odinms.tools);
importPackage(net.sf.odinms.client);
var 星星 = "#fEffect/CharacterEff/1114000/2/0#";
var 爱心 = "#fEffect/CharacterEff/1022223/4/0#";
var 红色箭头 = "#fUI/UIWindow/Quest/icon6/7#";
var 正方形 = "#fUI/UIWindow/Quest/icon3/6#";
var 蓝色箭头 = "#fUI/UIWindow/Quest/icon2/7#";
var status = 0;

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (mode == 0 && status == 0) {
			cm.dispose();
			return;
		}
		if (mode == 1)
			status++;
		else
			status--;
		if (status == 0) {
			
			cm.sendSimple("\t\t\t#e#r欢迎你来到[世纪冒险岛]#n\r\n#k欢迎进入#b世纪冒险岛#k~本服务器#r拒绝一切外挂#k，一切为了玩家着想，一切为了玩家玩的开心！!\r\n你可以通过我了解一些服务器信息以及新手礼包领取\r\n#r妹子#k玩家，通过找管理员认证，可以获得丰厚的福利哦！\r\n#k请选择你的操作！#n\r\n\r\n#L1##r#e" + 蓝色箭头 + "阅读新手帮助(建议新手先看看)#b#n\r\n\r\n#L2#" + 红色箭头 + "领取新手礼包，正式开始冒险之旅 ");
			} else if (status == 1) {
			if (selection == 1) {
				cm.sendOk("\t\t\t#e#b外挂一时爽，全家火葬场#n#d\r\n====================================================#k\r\n本服务器模式主要是按照{奥丁时代}设置的，增添部分新的功能，经验：1倍，爆率：1倍。复古长久服#d\r\n====================================================#k\r\n本服每周都有活动，人气超火爆！本服完美修复废弃、玩具、天空、海盗、男女、毒物、嘉年华、英语村、家族任务、家族联盟、学院系统、修复结婚。本服是长久服，服务器稳定，适合常驻的玩家#d\r\n====================================================#k\r\n本服务器按照官方服务器进行维护与修复。功能以仿官方为主！喜欢BT重口味的玩家请绕道！#d\r\n====================================================#k\r\n我们不出售#rBT装备，属性点，攻击力，各种装备礼包！人人平等！为了维护游戏平衡！玩家发现BUG请及时反馈给我们进行维护一个更好的游戏环境！#k#d\r\n====================================================#k\r\n本服务器开放现金道具交易，任何商城购买的道具均可以和其他玩家#r交易一次#k！点击玩家右键--即可使用#r现金道具交易#k功能！我们提倡玩家进行交易！汗水应该得到回报！#d\r\n====================================================#k\r\n本服务器按照官方服务器进行维护与修复。功能以仿官方为主！喜欢BT重口味的玩家请绕道！#d\r\n====================================================#k\r\n本服能增加经验的物品有：\r\n1、#v1122017##z1122017#\t佩戴即可享受50%经验加成\r\n2、结婚可获得\t{结婚经验加成30%}\r\n====================================================#k\r\n#e#b服务器赞助比例：\r\n1元=200点卷\r\n赞助联系管理员.QQ：923766669.\r\n可微信红包！也可支付宝！\r\n");
				cm.dispose();
			}else if(selection == 2) {
				cm.sendOk("#d亲爱的#r#h ##b您好，欢迎来到世纪冒险岛，管理员为你准备了丰富的新手礼包！！\r\n\r\n恭喜你获得：\r\n\r\n#r点卷=6000点、新手勋章一枚、快乐指环、特殊药水=100个、超级药水=100个、金币=100W、喇叭=80个");
                                cm.gainItem(5530000,-1);
                                cm.gainItem(2030000,+5);//回城卷
                cm.gainItem(5076000,+80);//道具喇叭
                cm.gainItem(2000005,+100);//超级
		cm.gainItem(1142263,2,2,2,2,50,50,0,0,2,2,2,2,2,2);
		cm.gainItem(1112793,1);
		cm.gainItem(2000004,+100);//特殊
		cm.gainMeso(+1000000);
                cm.gainNX(+6000);
                //cm.gainD(+1000);
                                cm.喇叭(3,"恭喜[" + cm.getPlayer().getName() + "]成功领取新手礼包，双倍经验卡请自行在商城购买，祝您游戏愉快！转职点击右下角拍卖【快捷转职】！！！");
                                cm.dispose();
			} 
		}
	}
}
