function start() {
    status = -1;

    action(1, 0, 0);
}
function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    }
    else {
        if (status >= 0 && mode == 0) {

            cm.sendOk("感谢你的光临！");
            cm.dispose();
            return;
        }
        if (mode == 1) {
            status++;
        }
        else {
            status--;
        }
        if (status == 0) {
            var tex2 = "";
            var text = "";
            for (i = 0; i < 10; i++) {
                text += "";
            }
			//显示物品ID图片用的代码是  #v这里写入ID#
            text += "#e#r累积充值达到3000礼包，可获得：#n#b\r\n1、祝福*混沌各25张\r\n2、皇家理发卷*10张\r\n3、狗狗鼻+5(四维+15、攻击+10、魔攻+10)\r\n4、回收精灵吊坠，并且在精灵吊坠上面+20G、+20魔攻\r\n5、给工地手套增加2次可升级次数（已经帮你砸好，砸完+9）\r\n6、给安全帽增加2次可升级次数（已经帮你砸好，砸完+9）\r\n7、给浪人披风增加2次可升级次数（已经帮你砸好，砸完+9）\r\n8、120永恒武器+11（如果不要，可以选龙背）\r\n9、任选一本70%或者50%的技能书，不保证百分百成功，看你自己的运气\r\n10、情侣椅子一对\r\n11、任选酷炫点装翅膀一个（攻击+5、魔攻+5）\r\n12、任选酷炫坐骑一个（蝙蝠船、御剑飞行、青蛙跳楼机、黑龙、天马、火马、筋斗云等）\r\n13、冒险币=3000万\r\n14、勋章一枚（全属性+40、攻击/魔攻+40、移动/跳跃+20、血/蓝+4000、防御、魔防、回避、命中+100）\r\n#r领取礼包必须要有足够的空间哦，否则被系统吞了东西，管理员不负责哦\r\n"//3
            text += "#L1##r#v4310028#领取累计充值3000礼包#l\r\n\r\n"//3
            cm.sendSimple(text);
        } else if (selection == 1) {
                      if(!cm.canHold(1112793,1)){
			cm.sendOk("请清理你的背包，至少空出2个位置！");
            cm.dispose();
        } else if(cm.haveItem(4310028,1)){
				cm.gainItem(4310028, -1);
				cm.gainItem(5150040, 10);//皇家
				cm.gainItem(2049100, 25);//祝福
				cm.gainItem(2340000, 25);//混沌
				cm.gainItem(1142742,40,40,40,40,4000,4000,40,40,100,100,100,100,20,20);//勋章
				cm.gainItem(1122017,0,0,0,0,0,0,20,20,0,0,0,0,0,0);//
				cm.gainMeso(30000000);
            cm.sendOk("领取成功，狗狗鼻+5、武器、任选技能书、情侣椅子、坐骑、翅膀必须找管理员获得！");
cm.喇叭(2, "恭喜[" + cm.getPlayer().getName() + "]成功领取累积充值礼包5！！");
            cm.dispose();
			}else{
            cm.sendOk("你的充值达不到限度，或者你已经领取过了，请勿重复领取！");
            cm.dispose();
			}
		}
    }
}


